{
    "Afro-": [
        {
            "definition": "word-forming element meaning \"African,\" from Latin Afr-, stem of Afer, Afri \"African\" (see Africa), or directly from African.", 
            "languages": [
                "Latin"
            ], 
            "pos": null, 
            "prefix": "Afro", 
            "term": "Afro-"
        }
    ], 
    "Anglo-": [
        {
            "definition": "from Medieval Latin Anglo-, comb. form of Angli \"the English\" (see Angle).", 
            "languages": [
                "English", 
                "Medieval Latin"
            ], 
            "pos": null, 
            "prefix": "Anglo", 
            "term": "Anglo-"
        }
    ], 
    "Austro-": [
        {
            "definition": "comb. form meaning \"Austrian;\" see Austria.", 
            "languages": [], 
            "pos": null, 
            "prefix": "Austro", 
            "term": "Austro-"
        }
    ], 
    "Euro-": [
        {
            "definition": "before vowels Eur-, word forming element meaning \"Europe, European,\" from comb. form of Europe.", 
            "languages": [], 
            "pos": null, 
            "prefix": "Euro", 
            "term": "Euro-"
        }
    ], 
    "Franco-": [
        {
            "definition": "word-forming element meaning \"French\" or \"the Franks,\" from Medieval Latin comb. form of Franci \"the Franks\" (see Frank), hence, by extension, \"the French.\" Used from early 18c. in forming English compound words.", 
            "languages": [
                "English", 
                "French", 
                "Medieval Latin"
            ], 
            "pos": null, 
            "prefix": "Franco", 
            "term": "Franco-"
        }
    ], 
    "Graeco-": [
        {
            "definition": "also Greco-, modern word-forming element, from Latin Graecus \"Greek\" (see Greek) on model of Anglo-, Franco-, etc.", 
            "languages": [
                "Greek", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "Graeco", 
            "term": "Graeco-"
        }
    ], 
    "Greco-": [
        {
            "definition": "see Graeco-.", 
            "languages": [], 
            "pos": null, 
            "prefix": "Greco", 
            "term": "Greco-"
        }
    ], 
    "Latino-": [
        {
            "definition": "prefix in use from 1939; see Latino.", 
            "languages": [
                "Latin"
            ], 
            "pos": null, 
            "prefix": "Latino", 
            "term": "Latino-"
        }
    ], 
    "Mac-": [
        {
            "definition": "common element in Scottish and Irish names, from Old Celtic *makko-s \"son.\" Cognate root *makwos \"son\" produced Old Welsh map, Welsh mab, ap \"son;\" also probably cognate with Old English mago \"son, attendant, servant,\" Old Norse mögr \"son,\" Gothic magus \"boy, servant,\" Old English mægð \"maid\" (see maiden).", 
            "languages": [
                "English", 
                "Gothic", 
                "Irish", 
                "Old Celtic", 
                "Old Norse", 
                "Scottish"
            ], 
            "pos": null, 
            "prefix": "Mac", 
            "term": "Mac-"
        }
    ], 
    "Nilo-": [
        {
            "definition": "used as a comb. form of Nile.", 
            "languages": [], 
            "pos": null, 
            "prefix": "Nilo", 
            "term": "Nilo-"
        }
    ], 
    "Romano-": [
        {
            "definition": "word-forming element meaning \"pertaining to Rome or Romans or their language,\" from comb. form of Latin Romanus (see Roman).", 
            "languages": [
                "Latin"
            ], 
            "pos": null, 
            "prefix": "Romano", 
            "term": "Romano-"
        }
    ], 
    "Russo-": [
        {
            "definition": "word-forming element meaning \"pertaining to Russia, Russians, or the Russian language,\" from comb. form of Medieval Latin Russi (plural) \"the Russians\" (see Russia).", 
            "languages": [
                "Medieval Latin", 
                "Russian"
            ], 
            "pos": null, 
            "prefix": "Russo", 
            "term": "Russo-"
        }
    ], 
    "Serbo-": [
        {
            "definition": "word-forming element meaning \"Serbian, Serbian and,\" from Latinized comb. form of Serb.", 
            "languages": [
                "Latin", 
                "Serb.", 
                "Serbian"
            ], 
            "pos": null, 
            "prefix": "Serbo", 
            "term": "Serbo-"
        }
    ], 
    "Sino-": [
        {
            "definition": "before vowels Sin-, word-forming element meaning \"Chinese,\" 1879, from Late Latin Sinæ (plural) \"the Chinese,\" from Ptolemaic Greek Sinai, from Arabic Sin \"China,\" probably from Chinese Ch'in, name of the fourth dynasty of China (see China).", 
            "languages": [
                "Arabic", 
                "Greek", 
                "Late Latin"
            ], 
            "pos": null, 
            "prefix": "Sino", 
            "term": "Sino-"
        }
    ], 
    "ab-": [
        {
            "definition": "word-forming element meaning \"away, from, from off, down;\" from Latin ab-, ab \"off, away from,\" cognate with Greek apo \"away from, from,\" Sanskrit apa \"away from,\" Gothic af, Old English of, from PIE root *apo- (see apo-). Reduced to a- before -m-, -p-, or -v-; sometimes abs- before -c- or -t-.", 
            "languages": [
                "English", 
                "Gothic", 
                "Greek", 
                "Latin", 
                "PIE", 
                "Sanskrit"
            ], 
            "pos": null, 
            "prefix": "ab", 
            "term": "ab-"
        }
    ], 
    "abs-": [
        {
            "definition": "form of ab- before -c-, -q- or -t-.", 
            "languages": [], 
            "pos": null, 
            "prefix": "abs", 
            "term": "abs-"
        }
    ], 
    "aceto-": [
        {
            "definition": "before vowels acet-, word-forming element from comb. form of acetic and generally indicating compounds from or related to acetic acid.", 
            "languages": [], 
            "pos": null, 
            "prefix": "aceto", 
            "term": "aceto-"
        }
    ], 
    "acro-": [
        {
            "definition": "word-forming element meaning \"highest, topmost, at the extremities,\" before vowels, acr-, from Greek akro- \"pertaining to an end, extreme,\" comb. form of akros \"at the end, at the top\" (see acrid).", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "acro", 
            "term": "acro-"
        }
    ], 
    "actino-": [
        {
            "definition": "before vowels actin-, word-forming element meaning \"pertaining to rays,\" from Greek aktis (genitive aktinos) \"ray, radiance;\" perhaps cognate with Sanskrit aktuh \"light, ray,\" Gothic uhtwo \"dawn, daybreak,\" Lithuanian anksti \"early.\"", 
            "languages": [
                "Gothic", 
                "Greek", 
                "Lithuanian", 
                "Sanskrit"
            ], 
            "pos": null, 
            "prefix": "actino", 
            "term": "actino-"
        }
    ], 
    "ad-": [
        {
            "definition": "word-forming element expressing direction toward or in addition to, from Latin ad \"to, toward\" in space or time; \"with regard to, in relation to,\" as a prefix, sometimes merely emphatic, from PIE *ad- \"to, near, at\" (cognate with Old English æt; see at). Simplified to a- before sc-, sp- and st-; modified to ac- before many consonants and then re-spelled af-, ag-, al-, etc., in conformity with the following consonant (as in affection, aggression). In Old French, reduced to a- in all cases (an evolution already underway in Merovingian Latin), but written forms in French were refashioned after Latin in 14c. and English did likewise 15c. in words it had picked up from Old French. In many cases pronunciation followed the shift.", 
            "languages": [
                "English", 
                "French", 
                "Latin", 
                "Old French", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "ad", 
            "term": "ad-"
        }
    ], 
    "aero-": [
        {
            "definition": "word-forming element meaning \"air, atmosphere; aircraft; gases,\" from Greek aero-, comb. form of aer (genitive aeros) \"air, lower atmosphere\" (see air (n.1)).", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "aero", 
            "term": "aero-"
        }
    ], 
    "aetio-": [
        {
            "definition": "word-forming element used in chemistry and indicating \"a fundamental degradation product of a complex organic compound\" [Flood], from Latinized comb. form of Greek aitia \"a cause, an origin\" (see etiology).", 
            "languages": [
                "Greek", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "aetio", 
            "term": "aetio-"
        }
    ], 
    "agro-": [
        {
            "definition": "word-forming element meaning \"pertaining to agriculture or cultivation,\" from Greek agro-, comb. form of agros \"field\" (see acre).", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "agro", 
            "term": "agro-"
        }
    ], 
    "allo-": [
        {
            "definition": "word-forming element meaning \"other,\" from Greek allo-, comb. form of allos \"other, different\" (see alias (adv.)).", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "allo", 
            "term": "allo-"
        }
    ], 
    "ambi-": [
        {
            "definition": "word-forming element meaning \"both, on both sides,\" from Latin ambi- \"around, round about,\" from PIE *ambhi \"around\" (cognates: Greek amphi \"round about;\" Sanskrit abhitah \"on both sides,\" abhi \"toward, to;\" Avestan aibi; Old English ymbe, German um; Gaulish ambi-, Old Irish imb- \"round about, about;\" Old Church Slavonic oba; Lithuanian abu \"both\"). The PIE root probably is an ablative plural of *ant-bhi \"from both sides,\" from *ant- \"front, forehead\" (see ante).", 
            "languages": [
                "English", 
                "Gaulish", 
                "German", 
                "Greek", 
                "Latin", 
                "Lithuanian", 
                "Old Church Slavonic", 
                "Old Irish", 
                "PIE", 
                "Sanskrit"
            ], 
            "pos": null, 
            "prefix": "ambi", 
            "term": "ambi-"
        }
    ], 
    "amino-": [
        {
            "definition": "1887, as an element in compound words involving chemicals, from comb. form of amine. Amino acid is attested from 1898.", 
            "languages": [], 
            "pos": null, 
            "prefix": "amino", 
            "term": "amino-"
        }
    ], 
    "amphi-": [
        {
            "definition": "before a vowel amph-, word-forming element from Greek amphi- \"both, of both kinds, on both sides, around,\" comb. form of amphi \"round about, around;\" cognate with Latin ambi- (see ambi-).", 
            "languages": [
                "Greek", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "amphi", 
            "term": "amphi-"
        }
    ], 
    "an-": [
        {
            "definition": "privative prefix, from Greek an-, \"not, without,\" related to ne- and cognate with Sanskrit an-, Latin in-, Gothic and Old English un- (see un- (1)).", 
            "languages": [
                "English", 
                "Gothic", 
                "Greek", 
                "Latin", 
                "Sanskrit"
            ], 
            "pos": null, 
            "prefix": "an", 
            "term": "an-"
        }, 
        {
            "definition": "form of Latin ad- before -n- (see ad-).", 
            "languages": [
                "Latin"
            ], 
            "pos": null, 
            "prefix": "an", 
            "term": "an-"
        }
    ], 
    "ana-": [
        {
            "definition": "before verbs an-, prefix meaning 1. \"upward,\" 2. \"back, backward, against,\" 3. \"again, anew,\" from Greek ana- \"up to, toward, exceedingly, back, against,\" from ana \"up, on, upon, throughout, again,\" cognate with Old English on, from PIE root *ano- \"on, upon, above\" (see on).", 
            "languages": [
                "English", 
                "Greek", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "ana", 
            "term": "ana-"
        }
    ], 
    "andro-": [
        {
            "definition": "word-forming element meaning \"man, male,\" from Greek andro-, comb. form of aner (genitive andros) \"man, male\" (see anthropo-).", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "andro", 
            "term": "andro-"
        }
    ], 
    "anemo-": [
        {
            "definition": "before vowels anem-, word-forming element meaning \"wind,\" from comb. form of Greek anemos (see anemone).", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "anemo", 
            "term": "anemo-"
        }
    ], 
    "angio-": [
        {
            "definition": "before verbs angi-, word-forming element now usually meaning \"covered or enclosed by a seed or blood vessel,\" from Latinized form of Greek angeion \"a vessel, receptacle,\" diminutive of angos \"chest, box,\" which is of unknown origin.", 
            "languages": [
                "Greek", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "angio", 
            "term": "angio-"
        }
    ], 
    "anomalo-": [
        {
            "definition": "word-forming element meaning \"deviating from the usual, abnormal,\" from comb. form of Greek anomalos \"uneven, irregular\" (see anomaly).", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "anomalo", 
            "term": "anomalo-"
        }
    ], 
    "ante-": [
        {
            "definition": "word-forming element meaning \"before, in front of; previous, existing beforehand; introductory to,\" from Latin ante (prep. and adv.) \"before, in front of, opposite,\" used in combinations, from PIE *anti \"facing opposite, near, in front of, before\" (see ante).", 
            "languages": [
                "Latin", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "ante", 
            "term": "ante-"
        }
    ], 
    "anthro-": [
        {
            "definition": "see anthropo-.", 
            "languages": [], 
            "pos": null, 
            "prefix": "anthro", 
            "term": "anthro-"
        }
    ], 
    "anthropo-": [
        {
            "definition": "before a vowel, anthrop-, word-forming element meaning \"pertaining to man or human beings,\" from comb. form of Greek anthropos \"man, human being\" (sometimes also including women) from Attic andra (genitive andros), from Greek aner \"man\" (as opposed to a woman, a god, or a boy), from PIE *ner- (2) \"man,\" also \"vigorous, vital, strong\" (cognates: Sanskrit nar-, Armenian ayr, Welsh ner).\r\n\nAnthropos sometimes is explained as a compound of aner and ops (genitive opos) \"eye, face;\" so literally \"he who has the face of a man.\" The change of -d- to -th- is difficult to explain; perhaps it is from some lost dialectal variant, or the mistaken belief that there was an aspiration sign over the vowel in the second element (as though *-dhropo-), which mistake might have come about by influence of common verbs such as horao \"to see.\"", 
            "languages": [
                "Armenian", 
                "Attic", 
                "Greek", 
                "PIE", 
                "Sanskrit"
            ], 
            "pos": null, 
            "prefix": "anthropo", 
            "term": "anthropo-"
        }
    ], 
    "anti-": [
        {
            "definition": "word-forming element meaning \"against, opposed to, opposite of, instead,\" from Old French anti- and directly from Latin anti-, from Greek anti \"against, opposite, instead of,\" also used as a prefix, from PIE *anti- \"against,\" also \"in front of\" (see ante). It appears in some words in Middle English but was not commonly used in word formations until modern times.", 
            "languages": [
                "Greek", 
                "Latin", 
                "Middle English", 
                "Old French", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "anti", 
            "term": "anti-"
        }
    ], 
    "ap-": [
        {
            "definition": "form of Latin ad- before words beginning in -p-; see ad-.", 
            "languages": [
                "Latin"
            ], 
            "pos": null, 
            "prefix": "ap", 
            "term": "ap-"
        }, 
        {
            "definition": "patronymic prefix in Welsh names, earlier map \"son,\" cognate with Gaelic mac. Since 17c. merged into surnames (Ap Rhys = Price, Ap Evan = Bevan, etc.).\r\n\r\nIt is said that a Welshman who evidently was not willing to be surpassed in length of pedigree, when making out his genealogical tree, wrote near the middle of his long array of 'aps' -- \"about this time Adam was born.\" [\"Origin and Significance of our Names,\" \"The Chautauquan,\" Oct. 1887-July 1888]\r\n", 
            "languages": [
                "Gaelic"
            ], 
            "pos": null, 
            "prefix": "ap", 
            "term": "ap-"
        }
    ], 
    "apo-": [
        {
            "definition": "before vowels ap-, word-forming element meaning \"from, away from, separate, free from,\" from Greek apo \"from, away from; after; in descent from,\" in compounds, \"from, asunder, away, off; finishing, completing; ceasing from; back again,\" from PIE root *apo- \"off, away\" (cognates: Sanskrit apa \"away from,\" Avestan apa \"away from,\" Latin ab \"away from, from,\" Gothic af, Old English of \"away from\").", 
            "languages": [
                "English", 
                "Gothic", 
                "Greek", 
                "Latin", 
                "PIE", 
                "Sanskrit"
            ], 
            "pos": null, 
            "prefix": "apo", 
            "term": "apo-"
        }
    ], 
    "aqua-": [
        {
            "definition": "word-forming element meaning \"water,\" from Latin aqua \"water; the sea; rain,\" cognate with Proto-Germanic *akhwo, source of Old English ea \"river,\" Gothic ahua \"river, waters,\" Old Norse Ægir, name of the sea-god, Old English ieg \"island;\" all from PIE *akwa- \"water\" (cognates: Sanskrit ap \"water,\" Hittite akwanzi \"they drink,\" Lithuanian uppe \"a river\").", 
            "languages": [
                "English", 
                "Gothic", 
                "Latin", 
                "Lithuanian", 
                "Old Norse", 
                "PIE", 
                "Proto-Germanic", 
                "Sanskrit"
            ], 
            "pos": null, 
            "prefix": "aqua", 
            "term": "aqua-"
        }
    ], 
    "arch-": [
        {
            "definition": "also archi-, word-forming element meaning \"chief, principal; extreme, ultra; early, primitive,\" from Latinized form of Greek arkh-, arkhi- \"first, chief, primeval,\" comb. form of arkhos \"chief\" (see archon).", 
            "languages": [
                "Greek", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "arch", 
            "term": "arch-"
        }
    ], 
    "archaeo-": [
        {
            "definition": "before vowels archae-, word-forming element meaning \"ancient, olden, primitive, primeval, from the beginning,\" from Latinized form of Greek arkhaio-, comb. form of arkhaios \"ancient,\" from arkhe \"beginning\" (see archon).", 
            "languages": [
                "Greek", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "archaeo", 
            "term": "archaeo-"
        }
    ], 
    "arterio-": [
        {
            "definition": "word-forming element meaning \"arterial,\" from Latinized comb. form of Greek arteria \"windpipe; artery\" (see artery).", 
            "languages": [
                "Greek", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "arterio", 
            "term": "arterio-"
        }
    ], 
    "arthro-": [
        {
            "definition": "word-forming element meaning \"pertaining to the joints,\" from Greek arthro- (before vowels arth-), comb. form of arthron \"joint,\" from PIE *ar-dhro-, from *ar- \"to fit together;\" see arm (n.1).", 
            "languages": [
                "Greek", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "arthro", 
            "term": "arthro-"
        }
    ], 
    "astro-": [
        {
            "definition": "element active in English word formation from mid-18c. and meaning \"star or celestial body; outer space,\" from Greek astro-, stem and comb. form of astron \"star,\" related to aster \"star\" (see star (n.)). In ancient Greek, aster typically was \"a star\" and astron mostly in plural, \"the stars.\" In singular it mostly meant \"Sirius\" (the brightest star).", 
            "languages": [
                "English", 
                "Greek"
            ], 
            "pos": null, 
            "prefix": "astro", 
            "term": "astro-"
        }
    ], 
    "at-": [
        {
            "definition": "assimilated form of ad- \"to, toward, before\" before stems beginning in -t-; see ad-.", 
            "languages": [], 
            "pos": null, 
            "prefix": "at", 
            "term": "at-"
        }
    ], 
    "atto-": [
        {
            "definition": "word-forming element meaning \"one quintillionth,\" 1962, from Danish atten \"eighteen\" (a quintillion is 10 to the 18th power), related to Old English eahtatene (see eighteen).", 
            "languages": [
                "Danish", 
                "English"
            ], 
            "pos": null, 
            "prefix": "atto", 
            "term": "atto-"
        }
    ], 
    "audio-": [
        {
            "definition": "word-forming element meaning \"sound, hearing,\" from comb. form of Latin audire \"hear,\" (see audience); first used in English as a word-formation element 1913.", 
            "languages": [
                "English", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "audio", 
            "term": "audio-"
        }
    ], 
    "auto-": [
        {
            "definition": "word-forming element meaning \"self, one's own, by oneself,\" from Greek auto- \"self, one's own,\" combining form of autos \"self, same,\" which is of unknown origin. Before a vowel, aut-; before an aspirate, auth-. In Greek also used as a prefix to proper names, as in automelinna \"Melinna herself.\" The opposite prefix would be allo-.", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "auto", 
            "term": "auto-"
        }
    ], 
    "azo-": [
        {
            "definition": "word-forming element denoting the presence of nitrogen, 1879, from comb. form of azote, the old term for \"nitrogen\" (from Greek a- \"not, without\" (see a- (3)) + zoion \"a living being;\" see zoo); coined in French by Lavoisier & de Morveau because living things cannot survive in the gas.", 
            "languages": [
                "French", 
                "Greek"
            ], 
            "pos": null, 
            "prefix": "azo", 
            "term": "azo-"
        }
    ], 
    "be-": [
        {
            "definition": "word-forming element with a wide range of meaning: \"thoroughly, completely; to make, cause seem; to provide with; at, on, to, for,\" from Old English be- \"on all sides\" (also used to make transitive verbs and as a privative or intensive prefix), from weak form of Old English bi \"by,\" probably cognate with second syllable of Greek amphi, Latin ambi and originally meaning \"about\" (see ambi-).\r\n\r\nThis sense naturally drifted into intensive (as in bespatter \"spatter about,\" therefore \"spatter very much\"). Be- can also be privative (as in behead), causative, or have just about any sense required. The prefix was productive 16c.-17c. in forming useful words, many of which have not survived, such as bethwack \"to thrash soundly\" (1550s), betongue \"to assail in speech, to scold\" (1630s).", 
            "languages": [
                "English", 
                "Greek", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "be", 
            "term": "be-"
        }
    ], 
    "bene-": [
        {
            "definition": "word-forming element meaning \"well,\" from Latin bene \"well, in the right way, honorably, properly,\" from PIE *dw-ene-, adverbial form of root *deu- (2) \"to do, perform; show favor, revere.\" From the same source come Latin bonus \"good,\" bellus \"handsome, fine, pretty,\" and possibly beatus \"blessed,\" beare \"to make blessed.\"", 
            "languages": [
                "Latin", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "bene", 
            "term": "bene-"
        }
    ], 
    "bi-": [
        {
            "definition": "word-forming element meaning \"two, twice, double, doubly, once every two,\" etc., from Latin bi- \"twice, double,\" from Old Latin dvi- (cognate with Sanskrit dvi-, Greek di-, Old English twi- \"twice, double\"), from PIE root *dwo- \"two.\" Nativized from 16c. Occasionally bin- before vowels; this form originated in French, not Latin, and might be partly based on or influenced by Latin bini \"twofold\" (see binary).", 
            "languages": [
                "English", 
                "French", 
                "Greek", 
                "Latin", 
                "PIE", 
                "Sanskrit"
            ], 
            "pos": null, 
            "prefix": "bi", 
            "term": "bi-"
        }
    ], 
    "biblico-": [
        {
            "definition": "word-forming element meaning \"biblical,\" from comb. form of Medieval Latin biblicus, from biblia (see bible).", 
            "languages": [
                "Medieval Latin"
            ], 
            "pos": null, 
            "prefix": "biblico", 
            "term": "biblico-"
        }
    ], 
    "biblio-": [
        {
            "definition": "word-forming element meaning \"book\" or sometimes \"Bible,\" from Greek biblio-, comb. form of biblion \"book\" (see Bible).", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "biblio", 
            "term": "biblio-"
        }
    ], 
    "bio-": [
        {
            "definition": "word-forming element, from Greek bio-, comb. form of bios \"one's life, course or way of living, lifetime\" (as opposed to zoe \"animal life, organic life\"), from PIE root *gweie- (1) \"to live\" (cognates: Sanskrit jivah \"alive, living;\" Old Persian *jivaka- \"alive,\" Middle Persian zhiwak \"alive;\" Old English cwic, cwicu \"living, alive;\" Latin vivus \"living, alive,\" vita \"life;\" Old Church Slavonic zivo \"to live;\" Lithuanian gyvas \"living, alive,\" gyvata \"(eternal) life;\" Old Irish bethu \"life,\" bith \"age;\" Welsh byd \"world\"). The correct usage is that in biography, but in modern science it has been extended to mean \"organic life.\"", 
            "languages": [
                "English", 
                "Greek", 
                "Latin", 
                "Lithuanian", 
                "Old Church Slavonic", 
                "Old Irish", 
                "Old Persian", 
                "PIE", 
                "Persian", 
                "Sanskrit"
            ], 
            "pos": null, 
            "prefix": "bio", 
            "term": "bio-"
        }
    ], 
    "bis-": [
        {
            "definition": "word-forming element meaning \"twice,\" from Latin bis \"twice, in two ways, doubly,\" from Old Latin dvis, cognate with Sanskrit dvih, Avestan bish, Greek dis, Middle High German zwis \"twice,\" from PIE *dwo- \"two\" (see two). Also the form of bi- used before -s-, -c-, or a vowel.", 
            "languages": [
                "Greek", 
                "Latin", 
                "Middle High German", 
                "PIE", 
                "Sanskrit"
            ], 
            "pos": null, 
            "prefix": "bis", 
            "term": "bis-"
        }
    ], 
    "blasto-": [
        {
            "definition": "before vowels blast-, word-forming element used in scientific compounds to mean \"germ, bud,\" from Greek blasto-, comb. form of blastos \"sprout, germ,\" which is of unknown origin.", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "blasto", 
            "term": "blasto-"
        }
    ], 
    "botryo-": [
        {
            "definition": "before vowels botry-, word-forming element meaning \"cluster, cluster-like,\" from Greek botrys \"cluster of grapes,\" which is of unknown origin.", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "botryo", 
            "term": "botryo-"
        }
    ], 
    "brachio-": [
        {
            "definition": "before a vowel, brachi-, word-forming element meaning \"arm,\" from Greek brakhion \"arm,\" perhaps originally \"upper arm,\" literally \"shorter,\" and from brakhys \"short\" (see brief (adj.)), in contrast to the longer forearm.", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "brachio", 
            "term": "brachio-"
        }
    ], 
    "brachy-": [
        {
            "definition": "word-forming element meaning \"short,\" from Latinized comb. form of Greek brakhys \"short\" (see brief (adj.)).", 
            "languages": [
                "Greek", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "brachy", 
            "term": "brachy-"
        }
    ], 
    "brady-": [
        {
            "definition": "medical word-forming element meaning \"slow, delayed, tardy,\" from Greek bradys \"slow;\" as in bradycardia (1890), with Latinized form of Greek kardia \"heart;\" bradykinesia, \"slow movement,\" with Greek kinesis \"movement, motion;\" bradypnea, with Greek pneo/pnein \"to breathe.\"", 
            "languages": [
                "Greek", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "brady", 
            "term": "brady-"
        }
    ], 
    "bryo-": [
        {
            "definition": "word-forming element meaning \"moss\" in scientific compounds, from Greek bryos, bryon \"moss.\"", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "bryo", 
            "term": "bryo-"
        }
    ], 
    "caco-": [
        {
            "definition": "before vowels cac-, word-forming element meaning \"bad, ill, poor\" (as in cacography, the opposite of calligraphy), from Latinized form of Greek kako- a hard-working prefix in ancient Greek, from kakos \"bad, evil,\" considered by etymologists probably to be connected with PIE *kakka- \"to defecate\" (see caca).", 
            "languages": [
                "Greek", 
                "Latin", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "caco", 
            "term": "caco-"
        }
    ], 
    "carbo-": [
        {
            "definition": "before vowels carb-, comb. form meaning \"carbon,\" abstracted 1810 from carbon.", 
            "languages": [], 
            "pos": null, 
            "prefix": "carbo", 
            "term": "carbo-"
        }
    ], 
    "cardio-": [
        {
            "definition": "before vowels cardi-, word-forming element meaning \"pertaining to the heart,\" from Latinized form of Greek kardia \"heart,\" from PIE root *kerd- (1) \"heart\" (see heart (n.)).", 
            "languages": [
                "Greek", 
                "Latin", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "cardio", 
            "term": "cardio-"
        }
    ], 
    "carpo-": [
        {
            "definition": "word-forming element meaning \"fruit,\" from Latinized form of Greek karpo-, comb. form of karpos \"fruit\" (see carpel).", 
            "languages": [
                "Greek", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "carpo", 
            "term": "carpo-"
        }, 
        {
            "definition": "word-forming element meaning \"wrist,\" from comb. form of Latin carpus, from Greek karpos \"wrist\" (see carpus).", 
            "languages": [
                "Greek", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "carpo", 
            "term": "carpo-"
        }
    ], 
    "cata-": [
        {
            "definition": "word-forming element from Latinized form of Greek kata-, before vowels kat-, from kata \"down from, down to.\" Its principal sense is \"down,\" but occasionally it has senses of \"against\" (catapult)or \"wrongly\" (catachresis). Also sometimes used as an intensive or with a sense of completion of action (catalogue). Very active in ancient Greek, this prefix is found in English mostly in words borrowed through Latin after c. 1500.", 
            "languages": [
                "English", 
                "Greek", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "cata", 
            "term": "cata-"
        }
    ], 
    "centi-": [
        {
            "definition": "word-forming element meaning \"one hundred\" or \"one hundredth part,\" used in English from c. 1800, from the French metric system, from Latin centi-, comb. form of centum \"one hundred\" (see hundred).", 
            "languages": [
                "English", 
                "French", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "centi", 
            "term": "centi-"
        }
    ], 
    "cephalo-": [
        {
            "definition": "before vowels, cephal-, word-forming element meaning \"head, skull, brain,\" Modern Latin combining form of Greek kephale \"head,\" perhaps from PIE *ghebh-el-.", 
            "languages": [
                "Greek", 
                "Modern Latin", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "cephalo", 
            "term": "cephalo-"
        }
    ], 
    "cerato-": [
        {
            "definition": "word-forming element meaning \"horn,\" from Latinized comb. form of Greek keras \"horn\" (see kerato-).", 
            "languages": [
                "Greek", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "cerato", 
            "term": "cerato-"
        }
    ], 
    "cero-": [
        {
            "definition": "word-forming element meaning \"waxy,\" from Latinized form of Greek kero-, comb. form of keros (see cere (n.)).", 
            "languages": [
                "Greek", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "cero", 
            "term": "cero-"
        }
    ], 
    "chaeto-": [
        {
            "definition": "before vowels chaet-, word-forming element meaning \"hair,\" also, in scientific use, \"spine, bristle,\" from Latinized form of Greek khaite \"long, flowing hair\"  (of persons, also of horses, lions), related to Avestan  gaesa- \"curly hair.\"", 
            "languages": [
                "Greek", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "chaeto", 
            "term": "chaeto-"
        }
    ], 
    "chemo-": [
        {
            "definition": "before vowels chem-, word-forming element denoting \"relation to chemical action or chemicals,\" from comb. form of chemical (adj.), used to form scientific compound words from c.1900.", 
            "languages": [], 
            "pos": null, 
            "prefix": "chemo", 
            "term": "chemo-"
        }
    ], 
    "chiono-": [
        {
            "definition": "before vowels chion-, word-forming element meaning \"snow,\" from Latinized form of Greek khion \"snow,\" related to kheima, kheimon \"winter\" (see hibernation).", 
            "languages": [
                "Greek", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "chiono", 
            "term": "chiono-"
        }
    ], 
    "chiro-": [
        {
            "definition": "before verbs chir-, word-forming element meaning \"hand,\" from Latinized form of Greek kheiro-, comb. form of kheir (genitive kheiros) \"the hand,\" from PIE *ghes- \"hand\" (cognates: Hittite keshshar, Armenian jern \"hand\").", 
            "languages": [
                "Armenian", 
                "Greek", 
                "Latin", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "chiro", 
            "term": "chiro-"
        }
    ], 
    "chloro-": [
        {
            "definition": "before vowels chlor-, word-forming element used in chemistry, usually indicating the presence of chlorine in a compound, but sometimes \"green,\" from Latinized comb. form of Greek khloros (see Chloe); also compare chlorine.", 
            "languages": [
                "Greek", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "chloro", 
            "term": "chloro-"
        }
    ], 
    "chondro-": [
        {
            "definition": "word-forming element meaning \"cartilage,\" from Latinized form of Greek khondros \"cartilage\" (of the breastbone); see grind (v.).", 
            "languages": [
                "Greek", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "chondro", 
            "term": "chondro-"
        }
    ], 
    "chromato-": [
        {
            "definition": "before vowels chromat-, word forming element indicating \"color; chromatin,\" from Latinized form of Greek khromato-, from khroma (see chroma).", 
            "languages": [
                "Greek", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "chromato", 
            "term": "chromato-"
        }
    ], 
    "chrono-": [
        {
            "definition": "before vowels chron-, word-forming element meaning \"time,\" from Latinized form of Greek khrono-, comb. form of khronos \"time, a defined time, a lifetime, a season, a while,\" which is of uncertain origin.", 
            "languages": [
                "Greek", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "chrono", 
            "term": "chrono-"
        }
    ], 
    "circum-": [
        {
            "definition": "word-forming element meaning \"around, all around, on all sides,\" from Latin circum- a common element in word-formation, from adverb and preposition circum \"around, round about,\" literally \"in a circle,\" probably accusative form of circus \"ring\" (see circus). In French, the element became circon-; Kitchin points out that con for cum is common even in classical Latin.", 
            "languages": [
                "French", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "circum", 
            "term": "circum-"
        }
    ], 
    "cirro-": [
        {
            "definition": "word-forming element meaning \"involving cirrus clouds,\" from comb. form of Latin cirrus (see cirrus).\r\n", 
            "languages": [
                "Latin"
            ], 
            "pos": null, 
            "prefix": "cirro", 
            "term": "cirro-"
        }
    ], 
    "cis-": [
        {
            "definition": "word-forming element meaning \"on the near side of, on this side,\" from Latin preposition cis \"on this side\" (in reference to place or time), related to citra (adv.) \"on this side,\" from PIE *ki-s, from root *ko- \"this\" (cognates: Old Church Slavonic si, Lithuanian šis, Hittite ki \"this,\" Old English hider, Gothic hidre \"hither;\" see he). Opposed to trans- or ultra-. Originally only of place, sometimes 19c. of time; 21c. of life situations (such as cis-gender, by 2011).", 
            "languages": [
                "English", 
                "Gothic", 
                "Latin", 
                "Lithuanian", 
                "Old Church Slavonic", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "cis", 
            "term": "cis-"
        }
    ], 
    "clino-": [
        {
            "definition": "before vowels clin-, word-forming element meaning \"slope, slant, incline,\" from Latinized comb. form of Greek klinein \"to lean, slope\" (see lean (v.)).", 
            "languages": [
                "Greek", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "clino", 
            "term": "clino-"
        }
    ], 
    "cn-": [
        {
            "definition": "consonant group used in Old English (the Clark Hall dictionary has 82 entries under cn-) but in Middle English all lost or turned to kn-. Also common in Greek, and retained in the spelling of some English words from Greek but not now admitted in speech, the n- only being sounded.", 
            "languages": [
                "English", 
                "Greek", 
                "Middle English"
            ], 
            "pos": null, 
            "prefix": "cn", 
            "term": "cn-"
        }
    ], 
    "co-": [
        {
            "definition": "in Latin, the form of com- in compounds with stems beginning in vowels and h- and gn- (see com-). Taken in English from 17c. as a living prefix meaning \"together, mutually, in common,\" and used promiscuously with native words and Latin-derived words not beginning with vowels, sometimes even with words already having it (such as co-conspiritor).", 
            "languages": [
                "English", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "co", 
            "term": "co-"
        }
    ], 
    "cocco-": [
        {
            "definition": "word-forming element meaning \"berry, seed,\" or something shaped like them, from Latinized form of Greek kokkos \"a grain, a seed,\" especially \"kermes-berry, gall of the kermes oak\" (actually an insect), which yields scarlet dye, a word of unknown origin, perhaps from a non-Greek source.", 
            "languages": [
                "Greek", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "cocco", 
            "term": "cocco-"
        }
    ], 
    "coeno-": [
        {
            "definition": "word-forming element meaning \"common,\" Latinized from Greek koinos \"common, public, shared, general, ordinary,\" from PIE *kom \"beside, near, by, with\" (see com-).", 
            "languages": [
                "Greek", 
                "Latin", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "coeno", 
            "term": "coeno-"
        }
    ], 
    "col-": [
        {
            "definition": "form of Latin com- before stems beginning in -l- (see com-).", 
            "languages": [
                "Latin"
            ], 
            "pos": null, 
            "prefix": "col", 
            "term": "col-"
        }
    ], 
    "com-": [
        {
            "definition": "word-forming element usually meaning \"with, together,\" from Latin com, archaic form of classical Latin cum \"together, together with, in combination,\" from PIE *kom- \"beside, near, by, with\" (compare Old English ge-, German ge-). The prefix in Latin sometimes was used as an intensive.\r\n\r\nBefore vowels and aspirates, reduced to co-; before -g-, assimilated to cog- or con-; before -l-, assimilated to col-; before -r-, assimilated to cor-; before -c-, -d-, -j-, -n-, -q-, -s-, -t-, -v- assimilated to con-.", 
            "languages": [
                "English", 
                "German", 
                "Latin", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "com", 
            "term": "com-"
        }
    ], 
    "con-": [
        {
            "definition": "word-forming element meaning \"together, with,\" sometimes merely intensive; the form of com- used in Latin before consonants except -b-, -p-, -l-, -m-, or -r-. In native English formations (such as costar), co- tends to be used where Latin would use con-.", 
            "languages": [
                "English", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "con", 
            "term": "con-"
        }
    ], 
    "contra-": [
        {
            "definition": "word-forming element meaning \"against, in opposition,\" from Latin adverb and preposition contra (see contra). The Latin word was used as a prefix in Late Latin. In French, it became contre- and passed into English as counter-. The Old English equivalent was wiðer (surviving in withers and widdershins), from wið \"with, against.\"", 
            "languages": [
                "English", 
                "French", 
                "Late Latin", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "contra", 
            "term": "contra-"
        }
    ], 
    "copro-": [
        {
            "definition": "word-forming element indicating \"dung, filth, excrement,\" before vowels copr-, from Modern Latin copro-, from Greek kopros \"dung,\" from PIE root *kekw-. Hence, coprology \"study of obscene literature.\"", 
            "languages": [
                "Greek", 
                "Modern Latin", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "copro", 
            "term": "copro-"
        }
    ], 
    "cosmo-": [
        {
            "definition": "before a vowel cosm-, word-forming element from Latinized form of Greek kosmos (see cosmos). In older use, \"the world, the universe;\" since 1950s, especially of outer space.", 
            "languages": [
                "Greek", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "cosmo", 
            "term": "cosmo-"
        }
    ], 
    "counter-": [
        {
            "definition": "word-forming element meaning \"against; in return; corresponding,\" from Anglo-French countre-, French contre-, from Latin contra \"opposite, contrary to, against, in return,\" also used as a prefix (see contra-).\r\n", 
            "languages": [
                "Anglo-French", 
                "French", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "counter", 
            "term": "counter-"
        }
    ], 
    "cranio-": [
        {
            "definition": "word-forming element meaning \"of the brain,\" from Latinized comb. form of Greek kranion \"skull\" (see cranium).", 
            "languages": [
                "Greek", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "cranio", 
            "term": "cranio-"
        }
    ], 
    "cross-": [
        {
            "definition": "word-forming element typically representing cross as a verb, adverb, adjective, and in many words a confluence of them.", 
            "languages": [], 
            "pos": null, 
            "prefix": "cross", 
            "term": "cross-"
        }
    ], 
    "cryo-": [
        {
            "definition": "word-forming element meaning \"very cold, freezing,\" from Latinized form of Greek kryo-, comb. form of kryos \"icy cold,\" related to kryeros \"chilling\" (see crust (n.)).", 
            "languages": [
                "Greek", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "cryo", 
            "term": "cryo-"
        }
    ], 
    "crypto-": [
        {
            "definition": "before vowels crypt-, word-forming element meaning \"secret\" or \"hidden,\" used in forming English words since at least 1760, from Latinized form of Greek kryptos \"hidden, concealed, secret\" (see crypt; the Greek comb. form was krypho-). Crypto-fascist is attested from 1937; crypto-communist from 1946.", 
            "languages": [
                "English", 
                "Greek", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "crypto", 
            "term": "crypto-"
        }
    ], 
    "cyclo-": [
        {
            "definition": "before a vowel, cycl-, word-forming element meaning \"circle, ring, rotation,\" from Latinized form of Greek kyklo-, comb. form of kyklos \"circle, wheel, ring\" (see cycle (n.)).", 
            "languages": [
                "Greek", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "cyclo", 
            "term": "cyclo-"
        }
    ], 
    "cyto-": [
        {
            "definition": "before a vowel, cyt-, word-forming element, from Latinized form of Greek kytos \"a hollow, receptacle, basket\" (from PIE *ku-ti-, from root *(s)keu- \"to cover, conceal;\" see hide (n.1)); used in modern science since c.1859 for \"cell,\" perhaps especially from the sense (in Aristophanes) of \"a cell of a hive of wasps or bees.\"", 
            "languages": [
                "Greek", 
                "Latin", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "cyto", 
            "term": "cyto-"
        }
    ], 
    "de-": [
        {
            "definition": "active word-forming element in English and in many words inherited from French and Latin, from Latin de \"down, down from, from, off; concerning\" (see de), also used as a prefix in Latin usually meaning \"down, off, away, from among, down from,\" but also \"down to the bottom, totally\" hence \"completely\" (intensive or completive), which is its sense in many English words. As a Latin prefix it also had the function of undoing or reversing a verb's action, and hence it came to be used as a pure privative -- \"not, do the opposite of, undo\" -- which is its primary function as a living prefix in English, as in defrost (1895), defuse (1943), etc. Compare also dis-.", 
            "languages": [
                "English", 
                "French", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "de", 
            "term": "de-"
        }
    ], 
    "deca-": [
        {
            "definition": "before a vowel, dec-, word-forming element meaning \"ten,\" from Latinized comb. form of Greek deka \"ten\" (see ten). In the metric system, \"multiplied by ten;\" while deci- means \"divided by ten.\"", 
            "languages": [
                "Greek", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "deca", 
            "term": "deca-"
        }
    ], 
    "deci-": [
        {
            "definition": "in the metric system, word-forming element denoting weights of one-tenth of the standard unit of measure, 1801, from French deci-, taken arbitrarily from Latin decimus \"tenth,\" from decem \"ten\" (see ten).", 
            "languages": [
                "French", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "deci", 
            "term": "deci-"
        }
    ], 
    "demi-": [
        {
            "definition": "word-forming element meaning \"half, half-sized, partial,\" early 15c., from Old French demi \"half\" (12c.), from Late Latin dimedius, from Latin dimidius \"half, one-half,\" which contains the elements dis- \"apart\" (see dis-) + medius \"middle\" (see medial).", 
            "languages": [
                "Late Latin", 
                "Latin", 
                "Old French"
            ], 
            "pos": null, 
            "prefix": "demi", 
            "term": "demi-"
        }
    ], 
    "dendro-": [
        {
            "definition": "word-forming element meaning \"tree,\" from Greek dendro-, comb. form of dendron \"tree,\" sometimes especially \"fruit tree\" (as opposed to hyle \"timber\"), from PIE *der-drew-, from root *deru- \"to be firm, solid, steadfast,\" specifically used for \"wood, tree\" (see tree (n.)).", 
            "languages": [
                "Greek", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "dendro", 
            "term": "dendro-"
        }
    ], 
    "deoxy-": [
        {
            "definition": "also desoxy-, word-forming element used to make chemical names for compounds which contain less oxygen than other compounds, from de- + first two syllables of oxygen", 
            "languages": [], 
            "pos": null, 
            "prefix": "deoxy", 
            "term": "deoxy-"
        }
    ], 
    "dermato-": [
        {
            "definition": "before vowels, dermat-, word-forming element meaning \"of or pertaining to skin,\" from Greek dermato- (shortened form dermo-), from derma \"skin\" (see derma).", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "dermato", 
            "term": "dermato-"
        }
    ], 
    "des-": [
        {
            "definition": "the usual form of Latin dis- in Old Italian, Spanish, Portuguese, Provençal, French.", 
            "languages": [
                "French", 
                "Latin", 
                "Old Italian", 
                "Portuguese", 
                "Provençal", 
                "Spanish"
            ], 
            "pos": null, 
            "prefix": "des", 
            "term": "des-"
        }
    ], 
    "desmo-": [
        {
            "definition": "before vowels desm-, word-forming element used in scientific compounds, from Greek desmos \"bond, fastening, chain,\" from PIE root *de- \"to bind.\"", 
            "languages": [
                "Greek", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "desmo", 
            "term": "desmo-"
        }
    ], 
    "dextro-": [
        {
            "definition": "word-forming element meaning \"toward or on the right-hand side,\" from comb. form of Latin dexter (see dexterity).", 
            "languages": [
                "Latin"
            ], 
            "pos": null, 
            "prefix": "dextro", 
            "term": "dextro-"
        }
    ], 
    "di-": [
        {
            "definition": "word-forming element meaning \"two, double, twice,\" from Greek di-, from dis \"twice,\" related to duo (see two).", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "di", 
            "term": "di-"
        }, 
        {
            "definition": "word-forming element meaning \"apart, asunder,\" form of dis- before certain voiced consonants.", 
            "languages": [], 
            "pos": null, 
            "prefix": "di", 
            "term": "di-"
        }, 
        {
            "definition": "word-forming element meaning \"through; thoroughly,\" form of dia- before vowels.", 
            "languages": [], 
            "pos": null, 
            "prefix": "di", 
            "term": "di-"
        }
    ], 
    "dia-": [
        {
            "definition": "before vowels, di-, word-forming element meaning \"through, thoroughly, entirely,\" from Greek dia-, from dia \"through, throughout,\" probably from the root of duo \"two\" (see two) with a base sense of \"twice.\"", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "dia", 
            "term": "dia-"
        }
    ], 
    "dis-": [
        {
            "definition": "(assimilated as dif- before -f-, to di- before most voiced consonants), word-forming element meaning 1. \"lack of, not\" (as in dishonest); 2. \"do the opposite of\" (as in disallow); 3. \"apart, away\" (as in discard), from Old French des- or directly from Latin dis- \"apart, in a different direction, between,\" figuratively \"not, un-,\" also \"exceedingly, utterly,\" from PIE *dis- \"apart, asunder\" (cognates: Old English te-, Old Saxon ti-, Old High German ze-, German zer-).\r\n\r\nThe PIE root is a secondary form of *dwis- and thus is related to Latin bis \"twice\" (originally *dvis) and to duo, on notion of \"two ways, in twain.\"\r\n\r\nIn classical Latin, dis- paralelled de- and had much the same meaning, but in Late Latin dis- came to be the favored form and this passed into Old French as des-, the form used for new compound words formed in Old French, where it increasingly had a privative sense (\"not\").\r\n\r\nIn English, many of these words eventually were altered back to dis-, while in French many have been altered back to de-. The usual confusion prevails.", 
            "languages": [
                "English", 
                "French", 
                "German", 
                "Late Latin", 
                "Latin", 
                "Old French", 
                "Old High German", 
                "Old Saxon", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "dis", 
            "term": "dis-"
        }
    ], 
    "dys-": [
        {
            "definition": "word-forming element meaning \"bad, ill, abnormal,\" from Greek dys-, inseparable prefix \"destroying the good sense of a word or increasing its bad sense\" [Liddell & Scott], \"bad, hard, unlucky,\" from PIE root (and prefix) *dus- \"bad, ill, evil\" (cognates: Sanskrit dus-, Old Persian duš- \"ill,\" Old English to-, Old High German zur-, Gothic tuz- \"un-\"), a derivative of the root *deu- (1) \"to lack, be wanting\" (source of Greek dein \"to lack, want\").\r\n\r\nVery productive in ancient Greek, where it could attach even to proper names (such as dysparis \"unhappy Paris\"); its entries take up nine columns in Liddell and Scott. Among the words formed from it were some English might covet: dysouristos \"fatally favorable, driven by a too-favorable wind;\" dysadelphos \"unhappy in one's brothers;\" dysagres \"unlucky in fishing;\" dysantiblepos \"hard to look in the face.\"", 
            "languages": [
                "English", 
                "Gothic", 
                "Greek", 
                "Old High German", 
                "Old Persian", 
                "PIE", 
                "Sanskrit", 
                "Scot."
            ], 
            "pos": null, 
            "prefix": "dys", 
            "term": "dys-"
        }
    ], 
    "ec-": [
        {
            "definition": "typical form in English of Latin ex-, Greek ex-, ek- before consonants (as in eclipse, ecstacy). See ex-.", 
            "languages": [
                "English", 
                "Greek", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "ec", 
            "term": "ec-"
        }
    ], 
    "eco-": [
        {
            "definition": "word-forming element referring to the environment and man's relation to it, abstracted from ecology, ecological; attested from 1969.", 
            "languages": [], 
            "pos": null, 
            "prefix": "eco", 
            "term": "eco-"
        }
    ], 
    "ecto-": [
        {
            "definition": "word-forming element generally meaning \"outside, external,\" before vowels ect-, from Latinized form of Greek adverb ektos \"outside, out of; free from; exempt\" (opposed to entos), used to form compounds in Greek (such as ektome \"a cutting out\"); related to Greek ek, ex \"out,\" from PIE *eghs \"out\" (see ex-).", 
            "languages": [
                "Greek", 
                "Latin", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "ecto", 
            "term": "ecto-"
        }
    ], 
    "electro-": [
        {
            "definition": "before vowels electr-, word-forming element meaning \"electrical, electricity,\" Latinized form of Greek elektro-, comb. form of elektron \"amber\" (see electric). As a stand-alone, formerly often short for electrotype, electroplate.\r\n", 
            "languages": [
                "Greek", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "electro", 
            "term": "electro-"
        }
    ], 
    "elytro-": [
        {
            "definition": "word-forming element used for \"vagina\" in medical terms, from Greek elytron, literally \"sheath\" (see elytra). Related: Elytral.", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "elytro", 
            "term": "elytro-"
        }
    ], 
    "em-": [
        {
            "definition": "word-forming element meaning \"put in or into, bring to a certain state,\" sometimes intensive, from French assimilation of en- \"in, into\" (see en- (1)) to following labial stop (-b-, -p-, and often -m-), or from the same development in later Latin in- (to im-). \"This rule was not fully established in spelling before the 17th c.\" [OED], but it is likely the pronunciation shift was in Old French and Middle English and spelling was slow to conform. Also a living prefix in English used to form verbs from adjectives and nouns (embitter, embody). In words such as emancipate, emerge, emit, emotion the e- is a reduced form of Latin ex- (see ex-) before -m-.", 
            "languages": [
                "English", 
                "French", 
                "Latin", 
                "Middle English", 
                "Old French"
            ], 
            "pos": null, 
            "prefix": "em", 
            "term": "em-"
        }
    ], 
    "en-": [
        {
            "definition": "word-forming element meaning \"in; into,\" from French and Old French en-, from Latin in- \"in, into\" (see in- (2)). Typically assimilated before -p-, -b-, -m-, -l-, and -r-. Latin in- became en- in French, Spanish, Portuguese, but remained in- in Italian.\r\n\r\nAlso used with native and imported elements to form verbs from nouns and adjectives, with a sense \"put in or on\" (encircle), also \"cause to be, make into\" (endear), and used as an intensive (enclose). Spelling variants in French that were brought over into Middle English account for parallels such as ensure/insure, and most en- words in English had at one time or another a variant in in-, and vice versa.", 
            "languages": [
                "English", 
                "French", 
                "Italian", 
                "Latin", 
                "Middle English", 
                "Old French", 
                "Portuguese", 
                "Spanish"
            ], 
            "pos": null, 
            "prefix": "en", 
            "term": "en-"
        }, 
        {
            "definition": "word-forming element meaning \"near, at, in, on, within,\" from Greek en \"in,\" cognate with Latin in (see in), and thus with en- (1). Typically assimilated to em- before -p-, -b-, -m-, -l-, and -r-.", 
            "languages": [
                "Greek", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "en", 
            "term": "en-"
        }
    ], 
    "encephalo-": [
        {
            "definition": "before vowels encephal-, word-forming element meaning \"brain, of the brain,\" from comb. form of medical Latin encephalon, from Greek enkephalos \"the brain,\" literally \"within the head,\" from en \"in\" (see en- (2)) + kephale \"head;\" see cephalo-.", 
            "languages": [
                "Greek", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "encephalo", 
            "term": "encephalo-"
        }
    ], 
    "endo-": [
        {
            "definition": "word-forming element meaning \"inside, within, internal,\" comb. form of Greek endon \"in, within,\" literally \"in the house of,\" from en \"in\" (see en- (2)) + base of domos \"house\" (see domestic).", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "endo", 
            "term": "endo-"
        }
    ], 
    "entero-": [
        {
            "definition": "before vowels enter-, word-forming element meaning \"intestine,\" from comb. form of Greek enteron \"an intestine, piece of gut\" (see enteric).", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "entero", 
            "term": "entero-"
        }
    ], 
    "ento-": [
        {
            "definition": "word-forming element used chiefly in biology and meaning \"within, inside, inner,\" from Greek ento-, comb. form of entos (adv., prep.) \"within, inside,\" as a noun, \"inner parts\" (cognate with Latin intus), from PIE *entos, from *en \"in\" (see in) + adverbial suffix -tos, denoting origin.", 
            "languages": [
                "Greek", 
                "Latin", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "ento", 
            "term": "ento-"
        }
    ], 
    "entre-": [
        {
            "definition": "in words from French, corresponds to English enter-, which is itself from French entre \"between, among\" (11c.), from Latin inter (see inter-).", 
            "languages": [
                "English", 
                "French", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "entre", 
            "term": "entre-"
        }
    ], 
    "eo-": [
        {
            "definition": "word-forming element, used from mid-19c. (first in Eocene) in compound words formed by earth-scientists, and meaning \"characterized by the earliest appearance of,\" from Greek eos \"dawn, morning, daybreak,\" also the name of the goddess of the morning, from PIE *aus- (1) \"to shine,\" especially of the dawn (see aurora). Piltdown Man, before exposed as a fraud, was known as Eoanthropus.", 
            "languages": [
                "Greek", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "eo", 
            "term": "eo-"
        }
    ], 
    "epi-": [
        {
            "definition": "before vowels reduced to ep-, before aspirated vowels eph-, word-forming element meaning \"on, upon, above,\" also \"in addition to; toward, among,\" from Greek epi \"upon, at, close upon (in space or time), on the occasion of, in addition,\" from PIE *epi, *opi \"near, at, against\" (cognates: Sanskrit api \"also, besides;\" Avestan aipi \"also, to, toward;\" Armenian ev \"also, and;\" Latin ob \"toward, against, in the way of;\" Oscan op, Greek opi- \"behind;\" Hittite appizzis \"younger;\" Lithuanian ap- \"about, near;\" Old Church Slavonic ob \"on\"). A productive prefix in Greek; also used in modern scientific compounds (such as epicenter).", 
            "languages": [
                "Armenian", 
                "Greek", 
                "Latin", 
                "Lithuanian", 
                "Old Church Slavonic", 
                "Oscan", 
                "PIE", 
                "Sanskrit"
            ], 
            "pos": null, 
            "prefix": "epi", 
            "term": "epi-"
        }
    ], 
    "equi-": [
        {
            "definition": "before vowels equ-, word-forming element meaning \"equal, having equal,\" from Latin aequi-, comb. form of aequus \"equal, even\" (see equal (adj.)).", 
            "languages": [
                "Latin"
            ], 
            "pos": null, 
            "prefix": "equi", 
            "term": "equi-"
        }
    ], 
    "erythro-": [
        {
            "definition": "before vowels erythr-, word-forming element meaning \"red,\" from comb. form of Greek erythros \"red\" (see red (1)).", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "erythro", 
            "term": "erythro-"
        }, 
        {
            "definition": "before vowels, erythr-, word-forming element meaning \"red,\" from Greek erythro-, comb. form of erythros \"red\" (in Homer, also the color of copper and gold); see red (1).", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "erythro", 
            "term": "erythro-"
        }
    ], 
    "eso-": [
        {
            "definition": "word-forming element meaning\" within,\" from Greek eso \"within\" (see esoteric).", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "eso", 
            "term": "eso-"
        }
    ], 
    "ethno-": [
        {
            "definition": "word-forming element meaning \"race, culture,\" from Greek ethnos \"people, nation, class, caste, tribe; a number of people accustomed to live together\" (see ethnic). Used to form modern compounds in the social sciences.", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "ethno", 
            "term": "ethno-"
        }
    ], 
    "eu-": [
        {
            "definition": "word-forming element, in modern use meaning \"good, well,\" from comb. form of Greek eus \"good,\" eu \"well\" (adv.), also \"luckily, happily\" (opposed to kakos), as a noun, \"the right, the good cause,\" from PIE *(e)su- \"good\" (cognates: Sanskrit su- \"good,\" Avestan hu- \"good\"). In compounds the Greek word had more a sense of \"greatness, abundance, prosperity,\" and was opposed to dys-.", 
            "languages": [
                "Greek", 
                "PIE", 
                "Sanskrit"
            ], 
            "pos": null, 
            "prefix": "eu", 
            "term": "eu-"
        }
    ], 
    "eury-": [
        {
            "definition": "word-forming element meaning \"wide,\" from comb. form of Greek eurys \"broad, wide,\" from PIE root *were- (1) \"wide, broad\" (cognates: Sanskrit uruh \"broad, wide\").", 
            "languages": [
                "Greek", 
                "PIE", 
                "Sanskrit"
            ], 
            "pos": null, 
            "prefix": "eury", 
            "term": "eury-"
        }
    ], 
    "ex-": [
        {
            "definition": "word-forming element, in English meaning usually \"out of, from,\" but also \"upwards, completely, deprive of, without,\" and \"former;\" from Latin ex \"out of, from within,\" from PIE *eghs \"out\" (cognates: Gaulish ex-, Old Irish ess-, Old Church Slavonic izu, Russian iz). In some cases also from Greek cognate ex, ek. PIE *eghs had comparative form *eks-tero and superlative *eks-t(e)r-emo-. Often reduced to e- before -b-, -d-, -g-, consonantal -i-, -l-, -m-, -n-, -v- (as in elude, emerge, evaporate, etc.).", 
            "languages": [
                "English", 
                "Gaulish", 
                "Greek", 
                "Latin", 
                "Old Church Slavonic", 
                "Old Irish", 
                "PIE", 
                "Russian"
            ], 
            "pos": null, 
            "prefix": "ex", 
            "term": "ex-"
        }
    ], 
    "exo-": [
        {
            "definition": "word-forming element meaning \"outer, outside, outer part\" used from mid-19c. in scientific words (such as exoskeleton), from Greek exo \"outside,\" related to ex \"out of\" (see ex-).", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "exo", 
            "term": "exo-"
        }
    ], 
    "extra-": [
        {
            "definition": "word-forming element meaning \"outside; beyond the scope of; in addition to what is usual or expected,\" in classical Latin recorded only in extraordinarius, but more used in Medieval Latin and modern formations; it represents Latin extra (adv.) \"on the outside, without, except,\" the old fem. ablative singular of exterus \"outward, outside,\" comparative of ex \"out of\" (see ex-).", 
            "languages": [
                "Latin", 
                "Medieval Latin"
            ], 
            "pos": null, 
            "prefix": "extra", 
            "term": "extra-"
        }
    ], 
    "extro-": [
        {
            "definition": "word-forming element meaning \"outwards,\" a variant of extra- by influence of intro-.", 
            "languages": [], 
            "pos": null, 
            "prefix": "extro", 
            "term": "extro-"
        }
    ], 
    "ferro-": [
        {
            "definition": "before vowels ferr-, word-forming element indicating the presence of or derivation from iron, from Latin ferro-, comb. form of ferrum \"iron,\" which is of unknown origin. Possibly of Semitic origin, via Etruscan [Klein]; Watkins suggests \"possibly borrowed (via Etruscan) from the same obscure source as OE bræs \"brass.\" Also sometimes especially indicative of the presence of iron in the ferrous state; ferri- indicating iron in the ferric state.", 
            "languages": [
                "Etruscan", 
                "Latin", 
                "Semitic"
            ], 
            "pos": null, 
            "prefix": "ferro", 
            "term": "ferro-"
        }
    ], 
    "fluoro-": [
        {
            "definition": "before vowels fluor-, comb. form of fluorine.", 
            "languages": [], 
            "pos": null, 
            "prefix": "fluoro", 
            "term": "fluoro-"
        }
    ], 
    "for-": [
        {
            "definition": "prefix usually meaning \"away, opposite, completely,\" from Old English for-, indicating loss or destruction, but in other cases completion, and used as well with intensive or pejorative force, from Proto-Germanic *fur \"before, in\" (cognates: Old Norse for-, Swedish för-, Dutch ver-, Old High German fir-, German ver-); from PIE *pr-, from root *per- (1) \"forward, through\" (see per).\r\n\r\nIn verbs the prefix denotes (a) intensive or completive action or process, or (b) action that miscarries, turns out for the worse, results in failure, or produces adverse or opposite results. In many verbs the prefix exhibits both meanings, and the verbs frequently have secondary and figurative meanings or are synonymous with the simplex. [Middle English Dictionary]\r\n\r\nProbably originally in Germanic with a sense of \"forward, forth,\" but it spun out complex sense developments in the historical languages. Disused in Modern English. Ultimately from the same root as fore (adv.). From its use in participles it came to be an intensive prefix of adjectives in Middle English (for example Chaucer's forblak \"exceedingly black\"), but all these now seem to be obsolete.", 
            "languages": [
                "Dutch", 
                "English", 
                "German", 
                "Germanic", 
                "Middle English", 
                "Modern English", 
                "Old High German", 
                "Old Norse", 
                "PIE", 
                "Proto-Germanic", 
                "Swedish"
            ], 
            "pos": null, 
            "prefix": "for", 
            "term": "for-"
        }
    ], 
    "fore-": [
        {
            "definition": "Middle English for-, fore-, from Old English fore-, often for- or foran-, from fore (adv. & prep.), which was used as a prefix in Old English as in other Germanic languages with a sense of \"before in time, rank, position,\" etc., or designating the front part or earliest time.", 
            "languages": [
                "English", 
                "Germanic", 
                "Middle English"
            ], 
            "pos": null, 
            "prefix": "fore", 
            "term": "fore-"
        }
    ], 
    "galacto-": [
        {
            "definition": "before vowels galact-, word-forming element meaning \"milk, milky,\" from Greek gala (stem galakt-; see galaxy).\r\n", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "galacto", 
            "term": "galacto-"
        }
    ], 
    "gastro-": [
        {
            "definition": "also gastero-, scientific word-forming element meaning \"stomach,\" before vowels gastr-, from Greek gastro-, comb. form of gaster (genitive gastros) \"belly, paunch; womb\" (see gastric). Also used in compounds in ancient Greek, as gastrobarys \"heavy with child.\"", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "gastro", 
            "term": "gastro-"
        }
    ], 
    "geo-": [
        {
            "definition": "word-forming element meaning \"earth, the Earth,\" ultimately from Greek geo-, comb. form of Attic and Ionic ge \"the earth, land, a land or country\" (see Gaia).", 
            "languages": [
                "Attic", 
                "Greek"
            ], 
            "pos": null, 
            "prefix": "geo", 
            "term": "geo-"
        }
    ], 
    "glosso-": [
        {
            "definition": "before vowels gloss-, word-forming element meaning \"tongue,\" from Greek glosso-, used as a comb. form of glossa (Attic glotta) \"tongue\" (see gloss (n.2)). Also sometimes meaning \"gloss, word inserted as explanation,\" as in glossography \"the writing of glosses.\"", 
            "languages": [
                "Attic", 
                "Greek"
            ], 
            "pos": null, 
            "prefix": "glosso", 
            "term": "glosso-"
        }
    ], 
    "glotto-": [
        {
            "definition": "word-forming element meaning \"language,\" from Attic Greek glotto-, from glotta, variant of glossa \"tongue; language\" (see gloss (n.2)).", 
            "languages": [
                "Attic", 
                "Greek"
            ], 
            "pos": null, 
            "prefix": "glotto", 
            "term": "glotto-"
        }
    ], 
    "gluco-": [
        {
            "definition": "before vowels, gluc-, word-forming element used since c.1880s, a later form of glyco-, from Greek glykys \"sweet,\" figuratively \"delightful; dear; simple, silly,\" from *glku-, dissimilated in Greek from PIE root *dlk-u- \"sweet\" (source also of Latin dulcis). Now usually with reference to glucose.", 
            "languages": [
                "Greek", 
                "Latin", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "gluco", 
            "term": "gluco-"
        }
    ], 
    "glyco-": [
        {
            "definition": "before vowels glyc-, word-forming element meaning \"sweet,\" from Latinized comb. form of Greek glykys, glykeros \"sweet\" (see gluco-). Used in reference to sugars generally. OED says a regular formation would be glycy-.", 
            "languages": [
                "Greek", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "glyco", 
            "term": "glyco-"
        }
    ], 
    "gn-": [
        {
            "definition": "consonant cluster at the head of some words; the -g- formerly was pronounced. Found in words from Old English (gnat, gnaw), in Low German, and Scandinavian as a variant of kn- (gneiss), in Latin and Greek (gnomon, gnostic) and representing sounds in non-Indo-European languages (gnu).", 
            "languages": [
                "English", 
                "Greek", 
                "Indo-European", 
                "Latin", 
                "Low German", 
                "Scandinavian"
            ], 
            "pos": null, 
            "prefix": "gn", 
            "term": "gn-"
        }
    ], 
    "gnatho-": [
        {
            "definition": "before vowels gnath-, word-forming element meaning \"jaw, mouth part, beak (of a bird),\" from Greek gnathos \"jaw\" (see gnathic).", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "gnatho", 
            "term": "gnatho-"
        }
    ], 
    "gono-": [
        {
            "definition": "before vowels gon-, word-forming element from Greek gonos \"seed, that which engenders,\" from PIE *gon-o-, suffixed form of root *gen- \"to give birth, beget\" (see genus).", 
            "languages": [
                "Greek", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "gono", 
            "term": "gono-"
        }
    ], 
    "grand-": [
        {
            "definition": "a special use of grand (adj.) in genealogical compounds, with the sense of \"a generation older than, or younger than,\" first attested c. 1200, in Anglo-French graund dame \"grandmother.\" Latin and Greek had similar usages of words for \"big, great.\"", 
            "languages": [
                "Anglo-French", 
                "Greek", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "grand", 
            "term": "grand-"
        }
    ], 
    "gu-": [
        {
            "definition": "because g- followed by some vowels in English usually has a \"soft\" pronunciation, a silent -u- sometimes was inserted between the g- and the vowel in Middle English to signal hardness, especially in words from French; but this was not done with many Scandinavian words where hard \"g\" precedes a vowel (gear (n.), get (v.), give, etc.). Germanic -w- generally became -gu- in words borrowed into Romance languages, but Old North French preserved the Frankish -w-, and English sometimes borrowed both forms, hence guarantee/warranty, guard/ward, etc.", 
            "languages": [
                "English", 
                "Frankish", 
                "French", 
                "Germanic", 
                "Middle English", 
                "Old North French", 
                "Scandinavian"
            ], 
            "pos": null, 
            "prefix": "gu", 
            "term": "gu-"
        }
    ], 
    "gymno-": [
        {
            "definition": "before vowels gymn-, word-forming element meaning \"naked, stripped, bare,\" from comb. form of Greek gymnos \"naked, unclad; bare, mere\" (see naked).", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "gymno", 
            "term": "gymno-"
        }
    ], 
    "gyneco-": [
        {
            "definition": "also gynaeco-, before a vowel gynec-, word-forming element meaning \"woman, female,\" from Latinized form of Greek gynaiko-, comb. form of gyne \"woman, female\" (see queen).", 
            "languages": [
                "Greek", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "gyneco", 
            "term": "gyneco-"
        }
    ], 
    "gyno-": [
        {
            "definition": "word-forming element equivalent to gyneco-.", 
            "languages": [], 
            "pos": null, 
            "prefix": "gyno", 
            "term": "gyno-"
        }
    ], 
    "gyro-": [
        {
            "definition": "word-forming element meaning \"gyrating\" or \"gyroscope,\" from comb. form of Greek gyros \"ring, circle\" (see gyre (n.)).", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "gyro", 
            "term": "gyro-"
        }
    ], 
    "half-": [
        {
            "definition": "\"sharing one parent,\" from half. Half-brother is attested from early 14c.; half-sister from c. 1200.", 
            "languages": [], 
            "pos": null, 
            "prefix": "half", 
            "term": "half-"
        }
    ], 
    "hali-": [
        {
            "definition": "word-forming element meaning \"salt, sea,\" from Greek hali-, comb. form of hals (genitive halos) \"a lump of salt, salt generally,\" in Homer, \"the sea,\" from PIE *sal- \"salt\" (see salt (n.)).", 
            "languages": [
                "Greek", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "hali", 
            "term": "hali-"
        }
    ], 
    "halo-": [
        {
            "definition": "before vowels hal-, word-forming element meaning \"salt, sea,\" from Greek hals (genitive halos) \"a lump of salt, salt generally,\" in Homer, \"the sea,\" from PIE *sal- \"salt\" (see salt (n.)).", 
            "languages": [
                "Greek", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "halo", 
            "term": "halo-"
        }
    ], 
    "haplo-": [
        {
            "definition": "word-forming element meaning \"simple, single; simply, once,\" from comb. form of Greek haplos \"single, simple.\"", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "haplo", 
            "term": "haplo-"
        }
    ], 
    "helio-": [
        {
            "definition": "word-forming element meaning \"sun,\" from Greek helio-, comb. form of helios \"sun\" (see sol).", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "helio", 
            "term": "helio-"
        }
    ], 
    "hemato-": [
        {
            "definition": "also haemato-, word-forming element meaning \"blood,\" from Greek haimato-, comb. form of haima (genitive haimatos) \"blood\" (see -emia).", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "hemato", 
            "term": "hemato-"
        }
    ], 
    "hemi-": [
        {
            "definition": "word-forming element meaning \"half,\" from Greek hemi- \"half,\" from PIE root *semi-, which is the source of Sanskrit sami, Latin semi- (see semi-), Old High German sami- \"half,\" and Old English sam-, denoting a partial or imperfect condition (see sandblind).", 
            "languages": [
                "English", 
                "Greek", 
                "Latin", 
                "Old High German", 
                "PIE", 
                "Sanskrit"
            ], 
            "pos": null, 
            "prefix": "hemi", 
            "term": "hemi-"
        }
    ], 
    "hemo-": [
        {
            "definition": "word-forming element meaning \"blood,\" perhaps via Old French hemo-, Latin haemo-, from Greek haimo-, from haima \"blood\" (see -emia).", 
            "languages": [
                "Greek", 
                "Latin", 
                "Old French"
            ], 
            "pos": null, 
            "prefix": "hemo", 
            "term": "hemo-"
        }
    ], 
    "hendeca-": [
        {
            "definition": "word-forming element meaning \"eleven,\" from Latinized form of Greek hendeka \"eleven,\" from hen, neuter of eis \"one\" + deka \"ten\" (see ten).", 
            "languages": [
                "Greek", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "hendeca", 
            "term": "hendeca-"
        }
    ], 
    "hepta-": [
        {
            "definition": "before vowels hept-, word-forming element meaning \"seven,\" from Greek hepta \"seven\" (see seven).", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "hepta", 
            "term": "hepta-"
        }
    ], 
    "hetero-": [
        {
            "definition": "word-forming element meaning \"other, different,\" from comb. form of Greek heteros \"the other (of two), another, different;\" first element meaning \"one, at one, together,\" from PIE *sem- \"one;\" the second cognate with the second element in Latin al-ter, Gothic an-þar, Old English o-ðer \"other.\"", 
            "languages": [
                "English", 
                "Gothic", 
                "Greek", 
                "Latin", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "hetero", 
            "term": "hetero-"
        }
    ], 
    "hexa-": [
        {
            "definition": "before vowels, hex-, word-forming element meaning \"six,\" from Greek hexa-, comb. form of hex \"six\" (see six).", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "hexa", 
            "term": "hexa-"
        }
    ], 
    "high-falutin'": [
        {
            "definition": "also highfalutin, 1848, U.S. slang, possibly from high-flying, or flown, or even flute.", 
            "languages": [], 
            "pos": null, 
            "prefix": "high-falutin", 
            "term": "high-falutin'"
        }
    ], 
    "hippo-": [
        {
            "definition": "before vowels, hipp-, word-forming element meaning \"horse,\" from Greek hippo-, from hippos \"horse,\" from PIE *ekwo- (see equine).", 
            "languages": [
                "Greek", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "hippo", 
            "term": "hippo-"
        }
    ], 
    "histo-": [
        {
            "definition": "medical word-forming element, from Greek histos \"warp, web,\" literally \"anything set upright,\" from histasthai \"to stand,\" from PIE *sta- \"to stand\" (see stet). Taken by 19c. medical writers as the best Greek root from which to form terminology for \"tissue.\"", 
            "languages": [
                "Greek", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "histo", 
            "term": "histo-"
        }
    ], 
    "historico-": [
        {
            "definition": "word-forming element meaning \"historical,\" from Latinized comb. form of Greek historikos (see historical).", 
            "languages": [
                "Greek", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "historico", 
            "term": "historico-"
        }
    ], 
    "holo-": [
        {
            "definition": "before vowels, hol-, word-forming element meaning \"whole, entire, complete,\" from Greek holo-, comb. form of holos \"whole, entire, complete,\" also \"safe and sound,\" from PIE *sol-wo-, from root *sol- (see safe (adj.)).", 
            "languages": [
                "Greek", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "holo", 
            "term": "holo-"
        }
    ], 
    "homeo-": [
        {
            "definition": "word-forming element meaning \"similar to,\" Latinized from Greek homio-, from homoios \"like, resembling, of the same kind,\" related to or an expanded form of homos \"one and the same,\" from PIE *sem- \"one, as one\" (see same).", 
            "languages": [
                "Greek", 
                "Latin", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "homeo", 
            "term": "homeo-"
        }
    ], 
    "homo-": [
        {
            "definition": "word-forming element meaning \"same, the same, equal, like,\" before vowels hom-, from Greek homos \"one and the same,\" also \"belonging to two or more jointly,\" from PIE *somos (cognates: Sanskrit samah \"even, the same,\" Lithuanian similis \"like,\" Gothic sama \"the same,\" samana \"together;\" see same).", 
            "languages": [
                "Gothic", 
                "Greek", 
                "Lithuanian", 
                "PIE", 
                "Sanskrit"
            ], 
            "pos": null, 
            "prefix": "homo", 
            "term": "homo-"
        }, 
        {
            "definition": "word-forming element meaning \"homosexual,\" abstracted since early 20c. from homosexual, and ultimately identical to homo- (1).", 
            "languages": [], 
            "pos": null, 
            "prefix": "homo", 
            "term": "homo-"
        }
    ], 
    "hyalo-": [
        {
            "definition": "word-forming element meaning \"of glass; glass-like, transparent,\" from Greek hyalos \"glass, clear alabaster,\" apparently a non-Greek word, said to be of Egyptian origin.", 
            "languages": [
                "Egyptian", 
                "Greek"
            ], 
            "pos": null, 
            "prefix": "hyalo", 
            "term": "hyalo-"
        }
    ], 
    "hydro-": [
        {
            "definition": "before vowels hydr-, word-forming element meaning \"water,\" from Greek hydro-, comb. form of hydor \"water\" (see water (n.1)). Also sometimes a comb. form of hydrogen.", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "hydro", 
            "term": "hydro-"
        }
    ], 
    "hygro-": [
        {
            "definition": "word-forming element meaning \"wet, moist, moisture,\" from Greek hygro-, comb. form of hygros \"wet, moist, fluid,\" from PIE root *wegw- \"wet.\"", 
            "languages": [
                "Greek", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "hygro", 
            "term": "hygro-"
        }
    ], 
    "hylo-": [
        {
            "definition": "word-forming element meaning \"wood, forest; matter,\" from Greek hylo-, from hylos \"wood; matter,\" of unknown origin.", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "hylo", 
            "term": "hylo-"
        }
    ], 
    "hyper-": [
        {
            "definition": "word-forming element meaning \"over, above, beyond, exceedingly, to excess,\" from Greek hyper (prep. and adv.) \"over, beyond, overmuch, above measure,\" from PIE super- \"over\" (see super-).", 
            "languages": [
                "Greek", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "hyper", 
            "term": "hyper-"
        }
    ], 
    "hypno-": [
        {
            "definition": "word-forming element meaning \"sleep,\" from Greek hypno-, comb. form of hypnos \"sleep\" (see somnolence).", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "hypno", 
            "term": "hypno-"
        }
    ], 
    "hypo-": [
        {
            "definition": "word-forming element meaning \"under, beneath\" (in chemistry, indicating a lesser oxidation), from hypo-, comb. form of Greek hypo (prep. and adverb) \"under,\" from PIE *upo- \"under, up from under, over\" (see sub-).", 
            "languages": [
                "Greek", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "hypo", 
            "term": "hypo-"
        }
    ], 
    "hypsi-": [
        {
            "definition": "word-forming element meaning \"on high,\" from Greek hypsi \"aloft, on high,\" related to hypsos \"height;\" cognate with Sanskrit os \"above, over,\" Old Church Slavonic vysoku \"high.\"", 
            "languages": [
                "Greek", 
                "Old Church Slavonic", 
                "Sanskrit"
            ], 
            "pos": null, 
            "prefix": "hypsi", 
            "term": "hypsi-"
        }
    ], 
    "iatro-": [
        {
            "definition": "word-forming element meaning \"physician, medicine, healing,\" from Greek iatro-, comb. form of iatros \"healer, physician\" (see -iatric).", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "iatro", 
            "term": "iatro-"
        }
    ], 
    "idio-": [
        {
            "definition": "word-forming element meaning \"one's own, personal, distinct,\" from Greek idio-, comb. form of idios \"own, personal, private, one's own\" (see idiom).", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "idio", 
            "term": "idio-"
        }
    ], 
    "il-": [
        {
            "definition": "assimilated form of Latin prefix in- used with words beginning in l-; see in-.", 
            "languages": [
                "Latin"
            ], 
            "pos": null, 
            "prefix": "il", 
            "term": "il-"
        }
    ], 
    "ileo-": [
        {
            "definition": "comb. form from ileum (q.v.).", 
            "languages": [], 
            "pos": null, 
            "prefix": "ileo", 
            "term": "ileo-"
        }
    ], 
    "im-": [
        {
            "definition": "variant of in- before -b-, -m-, -p-, in the sense of \"not, opposite of\" (immobile, impersonal) as well as \"in, into\" (implant, impoverish). See in-. In some English words it alternates with em- (1).", 
            "languages": [
                "English"
            ], 
            "pos": null, 
            "prefix": "im", 
            "term": "im-"
        }
    ], 
    "in-": [
        {
            "definition": "prefix meaning \"not, opposite of, without\" (also im-, il-, ir- by assimilation of -n- with following consonant), from Latin in- \"not,\" cognate with Greek an-, Old English un-, from PIE *ne \"not\" (see un- (1)).", 
            "languages": [
                "English", 
                "Greek", 
                "Latin", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "in", 
            "term": "in-"
        }, 
        {
            "definition": "element meaning \"into, in, on, upon\" (also im-, il-, ir- by assimilation of -n- with following consonant), from Latin in- \"in\" (see in). In Old French this often became en-, which usually was respelled in English to conform with Latin, but not always, which accounts for pairs like enquire/inquire. There was a native form, which in West Saxon usually appeared as on- (as in Old English onliehtan \"to enlighten\"), and some verbs survived into Middle English (such as inwrite \"to inscribe\"), but all now seem to be extinct. Not related to in- (1) \"not,\" which also was a common prefix in Latin: to the Romans impressus could mean \"pressed\" or \"unpressed.\"", 
            "languages": [
                "English", 
                "Latin", 
                "Middle English", 
                "Old French", 
                "West Saxon"
            ], 
            "pos": null, 
            "prefix": "in", 
            "term": "in-"
        }
    ], 
    "info-": [
        {
            "definition": "word-forming element abstracted from information.", 
            "languages": [], 
            "pos": null, 
            "prefix": "info", 
            "term": "info-"
        }
    ], 
    "infra-": [
        {
            "definition": "word-forming element from Latin infra (adv., prep.) \"below, underneath, beneath; later than, smaller, inferior to,\" from PIE *ndher \"under\" (cognates: Sanskrit adnah \"below,\" Old English under \"under, among;\" see under). Opposed to super-. Its use as a prefix was rare in Latin.", 
            "languages": [
                "English", 
                "Latin", 
                "PIE", 
                "Sanskrit"
            ], 
            "pos": null, 
            "prefix": "infra", 
            "term": "infra-"
        }
    ], 
    "inter-": [
        {
            "definition": "Latin inter (prep., adv.) \"among, between, betwixt, in the midst of,\" from PIE *enter \"between, among\" (cognates: Sanskrit antar, Old Persian antar \"among, between,\" Greek entera (plural) \"intestines,\" Old Irish eter, Old Welsh ithr \"among, between,\" Gothic undar, Old English under \"under\"), a comparative of *en \"in\" (see in). Also in certain Latin phrases in English, such as inter alia \"among other things.\" A living prefix in English from 15c. Spelled entre- in French, most words borrowed into English in that form were re-spelled 16c. to conform with Latin except entertain, enterprise.", 
            "languages": [
                "English", 
                "French", 
                "Gothic", 
                "Greek", 
                "Latin", 
                "Old Irish", 
                "Old Persian", 
                "PIE", 
                "Sanskrit"
            ], 
            "pos": null, 
            "prefix": "inter", 
            "term": "inter-"
        }
    ], 
    "intra-": [
        {
            "definition": "word-forming element meaning \"within, inside, on the inside,\" from Latin intra \"on the inside, within,\" related to inter \"between,\" from PIE *en-t(e)ro-, from root *en \"in\" (see in). Commonly opposed to extra-, but the use of intra as a prefix was rare in classical Latin.", 
            "languages": [
                "Latin", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "intra", 
            "term": "intra-"
        }
    ], 
    "intro-": [
        {
            "definition": "word-forming element, from Latin intro \"on the inside, within, to the inside,\" from PIE *en-t(e)ro-, suffixed form of preposition *en \"in\" (see in).", 
            "languages": [
                "Latin", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "intro", 
            "term": "intro-"
        }
    ], 
    "ir-": [
        {
            "definition": "assimilated form of Latin prefixes in- (see in-) before -r-.", 
            "languages": [
                "Latin"
            ], 
            "pos": null, 
            "prefix": "ir", 
            "term": "ir-"
        }
    ], 
    "iso-": [
        {
            "definition": "word-forming element meaning \"equal, similar, identical; isometric,\" from comb. form of Greek isos \"equal to, the same as\" (as in isometor \"like one's mother\"). Used properly only with words of Greek origin; the Latin equivalent is equi- (see equi-).", 
            "languages": [
                "Greek", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "iso", 
            "term": "iso-"
        }
    ], 
    "karyo-": [
        {
            "definition": "before vowels kary-, word-forming element used since c.1874 in biological terms referring to cell nuclei, from Greek karyon \"nut, kernel,\" possibly from PIE root *kar- \"hard\" (see hard (adj.)). ", 
            "languages": [
                "Greek", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "karyo", 
            "term": "karyo-"
        }
    ], 
    "keno-": [
        {
            "definition": "before vowels, ken-, word-forming element meaning \"empty,\" from comb. form of Greek kenos \"empty,\" from PIE root *ken- (3) \"empty.\"", 
            "languages": [
                "Greek", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "keno", 
            "term": "keno-"
        }
    ], 
    "ker-": [
        {
            "definition": "U.S. slang prefix, by 1836 as che-, 1843 as ker-, possibly from influence of German or Dutch ge-, past participial prefix; or ultimately echoic of the sound of the fall of some heavy body.", 
            "languages": [
                "Dutch", 
                "German"
            ], 
            "pos": null, 
            "prefix": "ker", 
            "term": "ker-"
        }
    ], 
    "kerato-": [
        {
            "definition": "before vowels, kerat-, word-forming element meaning \"horn, horny,\" from Greek keras (genitive keratos) \"horn,\" from PIE *ker- (1) \"horn, head\" (see horn (n.)).", 
            "languages": [
                "Greek", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "kerato", 
            "term": "kerato-"
        }
    ], 
    "kilo-": [
        {
            "definition": "word-forming element meaning \"one thousand,\" introduced in French 1795, when the metric system was officially adopted there, from Greek khilioi \"thousand,\" of unknown origin.", 
            "languages": [
                "French", 
                "Greek"
            ], 
            "pos": null, 
            "prefix": "kilo", 
            "term": "kilo-"
        }
    ], 
    "kineto-": [
        {
            "definition": "word-forming element meaning \"motion,\" from Greek kineto-, comb. form of kinetos (see kinetic).", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "kineto", 
            "term": "kineto-"
        }
    ], 
    "kino-": [
        {
            "definition": "before vowels, kin-, word-forming element meaning \"motion,\" from Greek kino-, from kinein \"to move\" (see cite).", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "kino", 
            "term": "kino-"
        }
    ], 
    "kn-": [
        {
            "definition": "Germanic consonant cluster; the sound is still evident in most sister languages but in English it has been reduced to \"n-\" in standard pronunciation since before 1750, and for about a century before that it had been pronounced hn-, dn-, tn-. It was fully voiced in Old and Middle English.", 
            "languages": [
                "English", 
                "Germanic", 
                "Middle English"
            ], 
            "pos": null, 
            "prefix": "kn", 
            "term": "kn-"
        }
    ], 
    "labio-": [
        {
            "definition": "word-forming element in medical use, taken as a comb. form of Latin labium \"lip\" (see lip (n.)).", 
            "languages": [
                "Latin"
            ], 
            "pos": null, 
            "prefix": "labio", 
            "term": "labio-"
        }
    ], 
    "lacto-": [
        {
            "definition": "before vowels, lac-, word-forming element meaning \"milk,\" from Latin lac (genitive lactis) \"milk,\" from PIE root *glakt- (see lactation).", 
            "languages": [
                "Latin", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "lacto", 
            "term": "lacto-"
        }
    ], 
    "leio-": [
        {
            "definition": "word-forming element meaning \"smooth,\" from Greek leio-, comb. form of leios \"smooth.\" E.g. leiotrichy \"condition of having straight, lank hair\" (1924).", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "leio", 
            "term": "leio-"
        }
    ], 
    "levo-": [
        {
            "definition": "word-forming element meaning \"toward the left,\" from French lévo-, from Latin laevus \"left\" (see left (adj.)).", 
            "languages": [
                "French", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "levo", 
            "term": "levo-"
        }
    ], 
    "lexico-": [
        {
            "definition": "word-forming element, from Latinized comb. form of Greek lexikos (see lexicon).", 
            "languages": [
                "Greek", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "lexico", 
            "term": "lexico-"
        }
    ], 
    "lieno-": [
        {
            "definition": "word-forming element meaning \"spleen,\" from Latin lien \"spleen\" (see spleen).", 
            "languages": [
                "Latin"
            ], 
            "pos": null, 
            "prefix": "lieno", 
            "term": "lieno-"
        }
    ], 
    "ligni-": [
        {
            "definition": "word-forming element meaning \"wood,\" from Latin lignum \"wood, firewood,\" from PIE *leg-no-, literally \"that which is collected,\" from root *leg- \"to collect\" (see lecture (n.)).", 
            "languages": [
                "Latin", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "ligni", 
            "term": "ligni-"
        }
    ], 
    "liparo-": [
        {
            "definition": "before vowels lipar-, word-forming element meaning \"oily,\" from Greek liparos \"oily, fatty, greasy,\" from lipos \"fat\" (see lipo-).", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "liparo", 
            "term": "liparo-"
        }
    ], 
    "lipo-": [
        {
            "definition": "word-forming element meaning \"fat\" (n.), from Greek lipo-, comb. form of lipos \"fat\" (n.), from PIE root *leip- \"to stick, adhere,\" also used to form words for \"fat,\" see leave (v.)).", 
            "languages": [
                "Greek", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "lipo", 
            "term": "lipo-"
        }
    ], 
    "litho-": [
        {
            "definition": "before vowels, lith-, word-forming element meaning \"stone, rock;\" from comb. form of Greek lithos \"stone, a precious stone, marble; a piece on a game board,\" of unknown origin.", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "litho", 
            "term": "litho-"
        }
    ], 
    "loco-": [
        {
            "definition": "word-forming element meaning \"from place to place,\" from comb. form of Latin locus (see locus).", 
            "languages": [
                "Latin"
            ], 
            "pos": null, 
            "prefix": "loco", 
            "term": "loco-"
        }
    ], 
    "logo-": [
        {
            "definition": "before vowels log-, word-forming element meaning \"speech, word,\" from Greek logos \"word\" (see logos).", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "logo", 
            "term": "logo-"
        }
    ], 
    "longi-": [
        {
            "definition": "word-forming element meaning \"long,\" from Latin longi-, comb. form of longus (see long (adj.)).", 
            "languages": [
                "Latin"
            ], 
            "pos": null, 
            "prefix": "longi", 
            "term": "longi-"
        }
    ], 
    "loxo-": [
        {
            "definition": "word-forming element meaning \"oblique,\" before vowels lox-, from Greek loxos \"slanting, crosswise, oblique.\" E.g. loxodromics \"art of oblique sailing.\"", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "loxo", 
            "term": "loxo-"
        }
    ], 
    "lumbo-": [
        {
            "definition": "word-forming element meaning \"loin, loins,\" from comb. form of Latin lumbus (see lumbago).", 
            "languages": [
                "Latin"
            ], 
            "pos": null, 
            "prefix": "lumbo", 
            "term": "lumbo-"
        }
    ], 
    "lyso-": [
        {
            "definition": "word-forming element indicating \"loosening, dissolving, freeing,\" before vowels lys-, from comb. form of Greek lysis \"a loosening\" (see lyse).", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "lyso", 
            "term": "lyso-"
        }
    ], 
    "macro-": [
        {
            "definition": "word-forming element meaning \"long, abnormally large, on a large scale,\" taken into English via Middle French and Medieval Latin from Greek makros \"long, large,\" from PIE root *mak- \"long, thin\" (cognates: Latin macer \"lean, thin;\" Old Norse magr, Old English mæger \"lean, thin;\" Greek mekos \"length\").", 
            "languages": [
                "English", 
                "Greek", 
                "Latin", 
                "Medieval Latin", 
                "Middle French", 
                "Old Norse", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "macro", 
            "term": "macro-"
        }
    ], 
    "magneto-": [
        {
            "definition": "word-forming element meaning \"magnetic, magnetism,\" from Greek magneto-, combining form of magnes (see magnet).", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "magneto", 
            "term": "magneto-"
        }
    ], 
    "magni-": [
        {
            "definition": "word-forming element meaning \"great,\" from Latin magni-, comb. form of magnus \"great\" (see magnate (n.)).", 
            "languages": [
                "Latin"
            ], 
            "pos": null, 
            "prefix": "magni", 
            "term": "magni-"
        }
    ], 
    "maitre d'": [
        {
            "definition": "also maitre d, 1943; see maître d'hôtel.", 
            "languages": [], 
            "pos": null, 
            "prefix": "maitre d", 
            "term": "maitre d'"
        }
    ], 
    "mal-": [
        {
            "definition": "word-forming element meaning \"bad, badly, ill, poorly, wrong, wrongly,\" from French mal (adv.), from Old French mal (adj., adv.) \"evil, ill, wrong, wrongly\" (9c.), from Latin male (adv.) \"badly,\" or malus (adj.) \"bad, evil\" (fem. mala, neuter malum), of unknown origin, perhaps related to Avestan mairiia \"treacherous.\" Most Modern English words with this prefix are 19c. coinages.", 
            "languages": [
                "French", 
                "Latin", 
                "Modern English", 
                "Old French"
            ], 
            "pos": null, 
            "prefix": "mal", 
            "term": "mal-"
        }
    ], 
    "mammo-": [
        {
            "definition": "word-forming element meaning \"breast,\" from Latin mamma \"breast\" (see mammal).", 
            "languages": [
                "Latin"
            ], 
            "pos": null, 
            "prefix": "mammo", 
            "term": "mammo-"
        }
    ], 
    "masto-": [
        {
            "definition": "before vowels mast-, word-forming element meaning \"breast,\" from comb. form of Greek mastos \"woman's breast,\" from madan \"to be wet, to flow,\" from PIE *mad- \"wet, moist, dripping\" (cognates: Latin madere \"be moist;\" Albanian mend \"suckle;\" see mast (n.2)).", 
            "languages": [
                "Greek", 
                "Latin", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "masto", 
            "term": "masto-"
        }
    ], 
    "mater-": [
        {
            "definition": "comb. form meaning \"mother,\" from Latin mater (see mother (n.)). ", 
            "languages": [
                "Latin"
            ], 
            "pos": null, 
            "prefix": "mater", 
            "term": "mater-"
        }
    ], 
    "matri-": [
        {
            "definition": "word-forming element meaning \"mother,\" from comb. form of Latin mater (genitive matris) \"mother\" (see mother (n.1)).", 
            "languages": [
                "Latin"
            ], 
            "pos": null, 
            "prefix": "matri", 
            "term": "matri-"
        }
    ], 
    "maxi-": [
        {
            "definition": "word-forming element meaning \"maximum, very large, very long,\" from comb. form of maximum.", 
            "languages": [], 
            "pos": null, 
            "prefix": "maxi", 
            "term": "maxi-"
        }
    ], 
    "mechano-": [
        {
            "definition": "word-forming element meaning \"mechanics, mechanism,\" from Greek mekhano-, comb. form of mekhane (see machine (n.)).", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "mechano", 
            "term": "mechano-"
        }
    ], 
    "medico-": [
        {
            "definition": "used as a comb. form of Latin medicus (see medical (adj.)).", 
            "languages": [
                "Latin"
            ], 
            "pos": null, 
            "prefix": "medico", 
            "term": "medico-"
        }
    ], 
    "medio-": [
        {
            "definition": "word-forming element from comb. form of Latin medius \"middle\" (see medial (adj.)).", 
            "languages": [
                "Latin"
            ], 
            "pos": null, 
            "prefix": "medio", 
            "term": "medio-"
        }
    ], 
    "mega-": [
        {
            "definition": "before vowels meg-, word-forming element often meaning \"large, great,\" but in precise scientific language \"one million\" (megaton, megawatt, etc.), from Greek megas \"great, large, vast, big, high, tall; mighty, important\" (fem. megale), from PIE *meg- \"great\" (cognates: Latin magnus, Old English micel; see mickle). Mega began to be used alone as an adjective by 1982.High-speed computer stores 2.5 megabits [headline in \"Electronics\" magazine, Oct. 1, 1957]", 
            "languages": [
                "English", 
                "Greek", 
                "Latin", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "mega", 
            "term": "mega-"
        }
    ], 
    "megalo-": [
        {
            "definition": "word-forming element meaning \"large, great, exaggerated,\" from comb. form of Greek megas \"large, great\" (stem megal-); see mickle.", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "megalo", 
            "term": "megalo-"
        }
    ], 
    "melano-": [
        {
            "definition": "word-forming element meaning \"black,\" from Greek melano-, comb. form of melas (genitive melanos) \"black, dark, murky\" (see melanin).", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "melano", 
            "term": "melano-"
        }
    ], 
    "mero-": [
        {
            "definition": "before vowels mer-, word-forming element meaning \"part, partial, fraction,\" from comb. form of Greek meros \"part, fraction\" (see merit (n.)).", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "mero", 
            "term": "mero-"
        }
    ], 
    "meso-": [
        {
            "definition": "word-forming element meaning \"middle, intermediate, halfway,\" sometimes mes- before vowels, comb. form of Greek mesos \"middle, in the middle; middling, moderate; between\" (see medial (adj.)).", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "meso", 
            "term": "meso-"
        }
    ], 
    "meta-": [
        {
            "definition": "word-forming element meaning 1. \"after, behind,\" 2. \"changed, altered,\" 3. \"higher, beyond;\" from Greek meta (prep.) \"in the midst of, in common with, by means of, in pursuit or quest of,\" from PIE *me- \"in the middle\" (cognates: German mit, Gothic miþ, Old English mið \"with, together with, among;\" see mid). Notion of \"changing places with\" probably led to senses \"change of place, order, or nature,\" which was a principal meaning of the Greek word when used as a prefix (but also denoting \"community, participation; in common with; pursuing\").\r\n\r\nThird sense, \"higher than, transcending, overarching, dealing with the most fundamental matters of,\" is due to misinterpretation of metaphysics as \"science of that which transcends the physical.\" This has led to a prodigious erroneous extension in modern usage, with meta- affixed to the names of other sciences and disciplines, especially in the academic jargon of literary criticism.", 
            "languages": [
                "English", 
                "German", 
                "Gothic", 
                "Greek", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "meta", 
            "term": "meta-"
        }
    ], 
    "micro-": [
        {
            "definition": "word-forming element meaning \"small, microscopic; magnifying; one millionth,\" from Latinized comb. form of Greek mikros \"small, little, petty, trivial, slight\" (see mica).", 
            "languages": [
                "Greek", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "micro", 
            "term": "micro-"
        }
    ], 
    "milli-": [
        {
            "definition": "word-forming element meaning \"thousandth part of a metric unit,\" from comb. form of Latin mille \"thousand\" (see million).", 
            "languages": [
                "Latin"
            ], 
            "pos": null, 
            "prefix": "milli", 
            "term": "milli-"
        }
    ], 
    "mini-": [
        {
            "definition": "word-forming element meaning \"miniature, minor,\" abstracted from miniature, with sense perhaps influenced by minimum.", 
            "languages": [], 
            "pos": null, 
            "prefix": "mini", 
            "term": "mini-"
        }
    ], 
    "mis-": [
        {
            "definition": "prefix meaning \"bad, wrong,\" from Old English mis-, from Proto-Germanic *missa- \"divergent, astray\" (cognates: Old Frisian and Old Saxon mis-, Middle Dutch misse-, Old High German missa-, German miß-, Old Norse mis-, Gothic missa-), perhaps literally \"in a changed manner,\" and with a root sense of \"difference, change\" (compare Gothic misso \"mutually\"), and thus from PIE *mit-to-, from root *mei- (1) \"to change\" (see mutable); see Watkins.\r\n\r\nOthers [Barnhart] see in Proto-Germanic *missa- the stem of an ancient past participle, related to Old English missan \"fail to hit\" (see miss (v.)), which is from the same PIE root.\r\n\r\nProductive as word-forming element in Old English (as in mislæran \"to give bad advice, teach amiss\"). In 14c.-16c. in a few verbs its sense began to be felt as \"unfavorably\" and was used as an intensive prefix with verbs already expressing negative feeling (as in misdoubt). Practically a separate word in Old and early Middle English (and often written as such). Old English also had an adjective (mislic \"diverse, unlike, various\") and an adverb (mislice \"in various directions, wrongly, astray\") derived from it, corresponding to German misslich (adj.).", 
            "languages": [
                "English", 
                "German", 
                "Gothic", 
                "Middle Dutch", 
                "Middle English", 
                "Old Frisian", 
                "Old High German", 
                "Old Norse", 
                "Old Saxon", 
                "PIE", 
                "Proto-Germanic"
            ], 
            "pos": null, 
            "prefix": "mis", 
            "term": "mis-"
        }, 
        {
            "definition": "in mischief, miscreant, etc., represents Old French mes- \"bad, badly, wrong, wrongly,\" from Vulgar Latin minus-, from Latin minus \"less\" (see minus), which was not used as a prefix. Perhaps influenced in Old French by *miss-, the Frankish equivalent of mis- (1).", 
            "languages": [
                "Frankish", 
                "Latin", 
                "Old French", 
                "Vulgar Latin"
            ], 
            "pos": null, 
            "prefix": "mis", 
            "term": "mis-"
        }
    ], 
    "miso-": [
        {
            "definition": "word-forming element meaning \"hater, hatred,\" before vowels, mis-, comb. form of Greek misos \"hatred,\" misein \"to hate.\" Productive as a word-forming element in ancient Greek, for instance misoagathia \"hatred of good or goodness;\" misoponein \"to hate work.\" Forming many compounds in English, most of them obscure or recherche, but some perhaps useful, for example misocapnic (adj.) \"hating (tobacco) smoke,\" misocyny \"hatred of dogs.\"", 
            "languages": [
                "English", 
                "Greek"
            ], 
            "pos": null, 
            "prefix": "miso", 
            "term": "miso-"
        }
    ], 
    "mixo-": [
        {
            "definition": "word-forming element meaning \"mixed,\" from Greek mixo-, from mixis \"a mixing, mingling, intercourse,\" from root of mignynai \"to mix, mix up, mingle\" (see mix (v.)). E.g. Mixolydian.", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "mixo", 
            "term": "mixo-"
        }
    ], 
    "mono-": [
        {
            "definition": "word-forming element meaning \"one, alone; containing one (atom, etc.),\" from Greek mono-, comb. form of monos \"single, alone,\" from PIE root *men- \"small, isolated\" (cognates: Greek manos \"rare, sparse,\" Armenian manr \"thin, slender, small,\" and perhaps English minnow).", 
            "languages": [
                "Armenian", 
                "English", 
                "Greek", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "mono", 
            "term": "mono-"
        }
    ], 
    "morpho-": [
        {
            "definition": "before vowels morph-, word-forming element meaning \"form, shape,\" from comb. form of Greek morphe \"form, shape; beauty, outward appearance\" (see Morpheus).\r\n", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "morpho", 
            "term": "morpho-"
        }
    ], 
    "moto-": [
        {
            "definition": "word-forming element meaning \"motion, motor,\" from Latin motus, past participle of movere (see move (v.)).", 
            "languages": [
                "Latin"
            ], 
            "pos": null, 
            "prefix": "moto", 
            "term": "moto-"
        }
    ], 
    "motor-": [
        {
            "definition": "element used extensively in 20c. word formation to indicate motorcar.", 
            "languages": [], 
            "pos": null, 
            "prefix": "motor", 
            "term": "motor-"
        }
    ], 
    "multi-": [
        {
            "definition": "before vowels mult-, word-forming element meaning \"many, many times, much,\" from comb. form of Latin multus \"much, many,\" from PIE *ml-to-, from root *mel- \"strong, great, numerous\" (cognates: Latin melior \"better,\" Greek mala \"very, very much\"). Many words that use it (multinational, etc.) are 20c. coinages.", 
            "languages": [
                "Greek", 
                "Latin", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "multi", 
            "term": "multi-"
        }
    ], 
    "musculo-": [
        {
            "definition": "word-forming element meaning \"involving or pertaining to muscles,\" from comb. form of Latin musculus \"muscle\" (see muscle (n.)).", 
            "languages": [
                "Latin"
            ], 
            "pos": null, 
            "prefix": "musculo", 
            "term": "musculo-"
        }
    ], 
    "musico-": [
        {
            "definition": "word-forming element from comb. form of Latin musicus (see music).", 
            "languages": [
                "Latin"
            ], 
            "pos": null, 
            "prefix": "musico", 
            "term": "musico-"
        }
    ], 
    "myco-": [
        {
            "definition": "before vowels myc-, word-forming element meaning \"mushroom, fungus,\" formed irregularly from Greek mykes \"fungus, mushroom, anything shaped like a mushroom,\" from PIE root *meug- \"slimy, slippery\" (see mucus). The correct form is myceto- (mycet-).", 
            "languages": [
                "Greek", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "myco", 
            "term": "myco-"
        }
    ], 
    "myelo-": [
        {
            "definition": "before vowels myel-, word-forming element meaning \"marrow, spinal cord,\" from Greek myelos \"marrow; the brain,\" of unknown origin.", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "myelo", 
            "term": "myelo-"
        }
    ], 
    "myo-": [
        {
            "definition": "before vowels my-, word-forming element meaning \"muscle,\" from comb. form of Greek mys \"muscle,\" literally \"mouse\" (see muscle (n.)).", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "myo", 
            "term": "myo-"
        }
    ], 
    "myxo-": [
        {
            "definition": "before vowels myx-, word-forming element meaning \"slime, mucus,\" from comb. form of Greek myxa \"mucus; lamp wick\" (see mucus).", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "myxo", 
            "term": "myxo-"
        }
    ], 
    "nano-": [
        {
            "definition": "introduced 1947 (at 14th conference of the Union Internationale de Chimie) as a prefix for units of one thousand-millionth part, from Greek nanos \"a dwarf.\" According to Watkins, this is originally \"little old man,\" from nannos \"uncle,\" masc. of nanna \"aunt\" (see nana). Earlier it was used as a prefix to mean \"dwarf, dwarfish,\" and still in a non-scientific sense of \"very small.\"", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "nano", 
            "term": "nano-"
        }
    ], 
    "narco-": [
        {
            "definition": "word-forming element meaning \"stupor, narcosis, sleep,\" from Latinized form of Greek narko-, comb. form of narke \"numbness\" (see narcotic (n.)).", 
            "languages": [
                "Greek", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "narco", 
            "term": "narco-"
        }
    ], 
    "necro-": [
        {
            "definition": "before vowels, necr-, word-forming element meaning \"death, corpse, dead tissue,\" from Latinized form of Greek nekros \"dead body, corpse, dead person,\" from PIE *nek- (1) \"death, natural death\" (cognates: Sanskrit nasyati \"disappears, perishes,\" Avestan nasyeiti \"disappears,\" nasu- \"corpse,\" Old Persian vi-nathayatiy \"he injures;\" Latin nex, genitive necis \"violent death, murder\" (as opposed to mors), nocere \"to harm, hurt,\" noxius \"harmful;\" Greek nekus \"dead\" (adj.), nekros \"dead body, corpse;\" Old Irish ec, Breton ankou, Welsh angeu \"death\").", 
            "languages": [
                "Breton", 
                "Greek", 
                "Latin", 
                "Old Irish", 
                "Old Persian", 
                "PIE", 
                "Sanskrit"
            ], 
            "pos": null, 
            "prefix": "necro", 
            "term": "necro-"
        }
    ], 
    "neo-": [
        {
            "definition": "word-forming element meaning \"new, recent,\" used in a seemingly endless number of adjectives and nouns, mostly coined since c.1880, from Greek neo-, comb. form of neos \"new, young, youthful; fresh, strange; lately, just now,\" from PIE root *newo- (see new).", 
            "languages": [
                "Greek", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "neo", 
            "term": "neo-"
        }
    ], 
    "nephro-": [
        {
            "definition": "before vowels nephr-, word-forming element meaning \"kidney, kidneys,\" from nephro-, comb. form of Greek nephros \"kidney\" (see nephron). ", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "nephro", 
            "term": "nephro-"
        }
    ], 
    "neuro-": [
        {
            "definition": "before vowels neur-, word-forming element meaning \"pertaining to a nerve or nerves or the nervous system,\" from Greek neuro-, comb. form of neuron \"nerve,\" originally \"sinew, tendon, cord, bowstring,\" also \"strength, vigor,\" from PIE *(s)neu- \"tendon, sinew\" (see nerve).", 
            "languages": [
                "Greek", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "neuro", 
            "term": "neuro-"
        }
    ], 
    "nitro-": [
        {
            "definition": "before vowels nitr-, word-forming element used scientifically and indicating \"nitrogen, nitrate\" or \"nitric acid,\" from comb. form of Greek nitron (see nitre).", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "nitro", 
            "term": "nitro-"
        }
    ], 
    "non-": [
        {
            "definition": "prefix meaning \"not, lack of,\" or \"sham,\" 14c., from Anglo-French noun-, from Old French non-, from Latin non \"not, by no means, not at all, not a,\" from Old Latin noenum \"not one\" (*ne oinom, from PIE *ne \"not\" + *oi-no-; see one). In some cases perhaps from Middle English non \"not\" (adj.), from Old English nan (see not).", 
            "languages": [
                "Anglo-French", 
                "English", 
                "Latin", 
                "Middle English", 
                "Old French", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "non", 
            "term": "non-"
        }
    ], 
    "nona-": [
        {
            "definition": "before vowels non-, word-forming element from comb. form of Latin nonus \"ninth\" (see nones). ", 
            "languages": [
                "Latin"
            ], 
            "pos": null, 
            "prefix": "nona", 
            "term": "nona-"
        }
    ], 
    "noso-": [
        {
            "definition": "word-forming element meaning \"disease,\" from comb. form of Greek nosos \"disease, sickness, malady,\" of unknown origin.", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "noso", 
            "term": "noso-"
        }
    ], 
    "nycto-": [
        {
            "definition": "before vowels nyct-, word-forming element meaning \"night,\" from Latinized form of Greek nykto-, comb. form of nyx \"night\" (see night).", 
            "languages": [
                "Greek", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "nycto", 
            "term": "nycto-"
        }
    ], 
    "ob-": [
        {
            "definition": "prefix meaning \"toward, against, across, down,\" also used as an intensive, from Latin ob \"toward, to, over against, in the way of, by reason of, about, before, in front of,\" from PIE root *epi, also *opi \"near, against\" (see epi-).", 
            "languages": [
                "Latin", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "ob", 
            "term": "ob-"
        }
    ], 
    "oc-": [
        {
            "definition": "assimilated form of ob- before -c-.", 
            "languages": [], 
            "pos": null, 
            "prefix": "oc", 
            "term": "oc-"
        }
    ], 
    "octa-": [
        {
            "definition": "before vowels oct-, word-forming element meaning \"eight,\" from Greek okta-, okt-, from PIE *okto(u) \"eight\" (see eight). The variant form octo- often appears in words taken from Latin, but the Greek form is said to be the more common in English.", 
            "languages": [
                "English", 
                "Greek", 
                "Latin", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "octa", 
            "term": "octa-"
        }
    ], 
    "octo-": [
        {
            "definition": "word-forming element, before vowels oct-, from comb. form of Latin octo \"eight\" (see octa-).", 
            "languages": [
                "Latin"
            ], 
            "pos": null, 
            "prefix": "octo", 
            "term": "octo-"
        }
    ], 
    "oeno-": [
        {
            "definition": "also oino-, word-forming element meaning \"pertaining to wine,\" from comb. form of Greek oinos \"wine\" (see wine (n.)).", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "oeno", 
            "term": "oeno-"
        }
    ], 
    "of-": [
        {
            "definition": "assimilated form of ob- before -f-.", 
            "languages": [], 
            "pos": null, 
            "prefix": "of", 
            "term": "of-"
        }
    ], 
    "oleo-": [
        {
            "definition": "word-forming element meaning \"oil\" or \"oleic,\" from Latin oleum (see oil (n.)).", 
            "languages": [
                "Latin"
            ], 
            "pos": null, 
            "prefix": "oleo", 
            "term": "oleo-"
        }
    ], 
    "oligo-": [
        {
            "definition": "before vowels olig-, word-forming element meaning \"few, the few,\" from comb. form of Greek oligos \"few, scanty, small, little,\" in plural, \"the few;\" of uncertain origin.", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "oligo", 
            "term": "oligo-"
        }
    ], 
    "omni-": [
        {
            "definition": "word-forming element meaning \"all,\" from Latin omni-, combining form of omnis \"all, every, the whole, of every kind,\" of unknown origin, perhaps literally \"abundant,\" from *op-ni-, from PIE root *op- (1) \"to work, produce in abundance\" (see opus).", 
            "languages": [
                "Latin", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "omni", 
            "term": "omni-"
        }
    ], 
    "omo-": [
        {
            "definition": "before vowels om-, word-forming element meaning \"raw, unripe,\" from Greek omo-, comb. form of omos \"raw,\" from PIE root *om- \"raw, sharp-tasting\" (cognates: Sanskrit amah \"raw, uncooked, unripe,\" Old Irish om, Welsh of).", 
            "languages": [
                "Greek", 
                "Old Irish", 
                "PIE", 
                "Sanskrit"
            ], 
            "pos": null, 
            "prefix": "omo", 
            "term": "omo-"
        }
    ], 
    "omphalo-": [
        {
            "definition": "before vowels omphal-, word-forming element meaning \"navel,\" from Greek omphalos (see omphalos).", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "omphalo", 
            "term": "omphalo-"
        }
    ], 
    "onco-": [
        {
            "definition": "word-forming element meaning \"bulk, mass,\" especially in medical use, \"tumor,\" from Latinized form of Greek onko-, comb. form of onkos \"bulk, size, mass, body.\"", 
            "languages": [
                "Greek", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "onco", 
            "term": "onco-"
        }
    ], 
    "oneiro-": [
        {
            "definition": "before vowels oneir-, word-forming element meaning \"dream,\" from Greek oneiros \"a dream,\" from PIE *oner- \"dream.\"", 
            "languages": [
                "Greek", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "oneiro", 
            "term": "oneiro-"
        }
    ], 
    "onto-": [
        {
            "definition": "word-forming element meaning \"a being, individual; being, existence,\" from Greek onto-, from stem of on (genitive ontos) \"being,\" neuter present participle of einai \"to be\" (see essence).", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "onto", 
            "term": "onto-"
        }
    ], 
    "oo-": [
        {
            "definition": "word-forming element meaning \"egg, eggs,\" from Greek oon \"egg,\" cognate with Latin ovum, Old Norse egg (see egg (n.)).", 
            "languages": [
                "Greek", 
                "Latin", 
                "Old Norse"
            ], 
            "pos": null, 
            "prefix": "oo", 
            "term": "oo-"
        }
    ], 
    "op-": [
        {
            "definition": "assimilated form of ob- before -p-.", 
            "languages": [], 
            "pos": null, 
            "prefix": "op", 
            "term": "op-"
        }
    ], 
    "ophio-": [
        {
            "definition": "before vowels ophi-, word-forming element meaning \"a snake, serpent,\" from Greek ophio-, comb. form of ophis \"serpent, a snake,\" from PIE *ogwhi-.", 
            "languages": [
                "Greek", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "ophio", 
            "term": "ophio-"
        }
    ], 
    "ophthalmo-": [
        {
            "definition": "before vowels ophthalm-, word-forming element meaning \"eye,\" mostly in plural, \"the eyes,\" from Greek ophthalmo-, comb. form of ophthalmos \"eye,\" originally \"the seeing,\" of uncertain origin. Perhaps from ops \"eye\" (see optic) + a form related to thalamos \"inner room, chamber\" (see thalamus), giving the whole a sense of \"eye and eye socket.\"", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "ophthalmo", 
            "term": "ophthalmo-"
        }
    ], 
    "ornitho-": [
        {
            "definition": "before vowels ornith-, word-forming element meaning \"bird, birds,\" from comb. form of Greek ornis (genitive ornithos) \"a bird\" (in Attic generally \"domestic fowl\"), often added to the specific name of the type of bird, from PIE *or- \"large bird\" (see erne).", 
            "languages": [
                "Attic", 
                "Greek", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "ornitho", 
            "term": "ornitho-"
        }
    ], 
    "oro-": [
        {
            "definition": "word-forming element meaning \"mountain,\" from Greek oros \"mountain\" (see oread).", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "oro", 
            "term": "oro-"
        }
    ], 
    "ortho-": [
        {
            "definition": "before vowels orth-, word-forming element meaning \"straight, upright, rectangular, regular; true, correct, proper,\" now mostly in scientific and technical compounds, from Greek ortho-, stem of orthos \"straight, true, correct, regular,\" from PIE *eredh- \"high\" (cognates: Sanskrit urdhvah \"high, lofty, steep,\" Latin arduus \"high, steep,\" Old Irish ard \"high\").", 
            "languages": [
                "Greek", 
                "Latin", 
                "Old Irish", 
                "PIE", 
                "Sanskrit"
            ], 
            "pos": null, 
            "prefix": "ortho", 
            "term": "ortho-"
        }
    ], 
    "os-": [
        {
            "definition": "frequent form of ob- before -c- and -t- in words from Latin.", 
            "languages": [
                "Latin"
            ], 
            "pos": null, 
            "prefix": "os", 
            "term": "os-"
        }
    ], 
    "osteo-": [
        {
            "definition": "before vowels oste-, word-forming element meaning \"bone, bones,\" from Greek osteon \"bone\" (see osseous).", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "osteo", 
            "term": "osteo-"
        }
    ], 
    "over-": [
        {
            "definition": "word-forming element meaning \"above; highest; across; too much; above normal; outer,\" from Old English ofer (see over). Over and its Germanic relations were widely used as prefixes, and sometimes could be used with negative force. This is rare in Modern English, but compare Gothic ufarmunnon \"to forget,\" ufar-swaran \"to swear falsely;\" Old English ofercræft \"fraud.\"", 
            "languages": [
                "English", 
                "Germanic", 
                "Gothic", 
                "Modern English"
            ], 
            "pos": null, 
            "prefix": "over", 
            "term": "over-"
        }
    ], 
    "oxy-": [
        {
            "definition": "word-forming element meaning \"sharp, pointed; acid,\" from Greek oxy-, comb. form of oxys \"sharp, pungent\" (see acrid). Also used as a comb. form of oxygen.", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "oxy", 
            "term": "oxy-"
        }
    ], 
    "paedo-": [
        {
            "definition": "see pedo-.", 
            "languages": [], 
            "pos": null, 
            "prefix": "paedo", 
            "term": "paedo-"
        }
    ], 
    "palaeo-": [
        {
            "definition": "see paleo-.", 
            "languages": [], 
            "pos": null, 
            "prefix": "palaeo", 
            "term": "palaeo-"
        }
    ], 
    "paleo-": [
        {
            "definition": "before vowels pale- word-forming element used in scientific combinations (mostly since c.1870) meaning \"ancient, early, prehistoric, primitive,\" from Latinized form of Greek palaios \"old, ancient,\" from palai \"long ago, far back,\" related to palin \"again, backwards,\" tele- \"far off, at a distance,\" from PIE root *kwel- (2) \"far\" in space and time\" (see tele-).", 
            "languages": [
                "Greek", 
                "Latin", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "paleo", 
            "term": "paleo-"
        }
    ], 
    "pan-": [
        {
            "definition": "word-forming element meaning \"all, every, whole, all-inclusive,\" from Greek pan-, combining form of pas (neuter pan, masculine and neuter genitive pantos) \"all,\" from PIE *pant- \"all\" (with derivatives found only in Greek and Tocharian).\r\n\r\nCommonly used as a prefix in Greek, in modern times often with nationality names, the first example of which seems to have been Panslavism (1846). Also panislamic (1881), pan-American (1889), pan-German (1892), pan-African (1900), pan-European (1901), pan-Arabism (1930).", 
            "languages": [
                "German", 
                "Greek", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "pan", 
            "term": "pan-"
        }
    ], 
    "para-": [
        {
            "definition": "before vowels, par-, word-forming element meaning \"alongside, beyond; altered; contrary; irregular, abnormal,\" from Greek para- from para (prep.) \"beside, near, issuing from, against, contrary to,\" from PIE *prea, from root *per- (1) \"forward, through\" (see per). Cognate with Old English for- \"off, away.\"", 
            "languages": [
                "English", 
                "Greek", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "para", 
            "term": "para-"
        }, 
        {
            "definition": "word-forming element meaning \"defense, protection against; that which protects from,\" from Italian para, imperative of parare \"to ward off,\" from Latin parare \"make ready\" (see pare).", 
            "languages": [
                "Italian", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "para", 
            "term": "para-"
        }
    ], 
    "parmaco-": [
        {
            "definition": "word-forming element meaning \"drug, medicine,\" also \"poison,\" from Latinized form of Greek pharmako-, comb. form of pharmakon \"drug, poison\" (see pharmacy).", 
            "languages": [
                "Greek", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "parmaco", 
            "term": "parmaco-"
        }
    ], 
    "parti-": [
        {
            "definition": "\"in two ways,\" word-forming element extracted late 16c. from parti-colored.", 
            "languages": [], 
            "pos": null, 
            "prefix": "parti", 
            "term": "parti-"
        }
    ], 
    "parvi-": [
        {
            "definition": "word-forming element used in science and meaning \"small, little,\" from comb. form of Latin parvus \"small,\" from metathesized form of PIE *pau-ro-, from base *pau- \"few, little\" (see few).", 
            "languages": [
                "Latin", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "parvi", 
            "term": "parvi-"
        }
    ], 
    "patho-": [
        {
            "definition": "before vowels path-, word-forming element meaning \"Suffering, disease,\" from Greek patho-, comb. form of pathos \"suffering, disease\" (see pathos).", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "patho", 
            "term": "patho-"
        }
    ], 
    "patri-": [
        {
            "definition": "word-forming element used to make terms describing kinship of the father or the paternal line, from Latin patri-, comb. form of pater (see father (n.)). ", 
            "languages": [
                "Latin"
            ], 
            "pos": null, 
            "prefix": "patri", 
            "term": "patri-"
        }
    ], 
    "pedo-": [
        {
            "definition": "before vowels ped-, word-forming element meaning \"boy, child,\" from Greek pedo-, comb. form of pais \"boy, child,\" especially a son, from PIE root *peu- \"small, little, few, young\" (see few (adj.)). The British form paed- is better because it avoids confusion with ped-.", 
            "languages": [
                "Greek", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "pedo", 
            "term": "pedo-"
        }
    ], 
    "pen-": [
        {
            "definition": "Brythonic for \"head;\" common in place names in Cornwall and Wales (such as Penzance, see also Pendragon).", 
            "languages": [], 
            "pos": null, 
            "prefix": "pen", 
            "term": "pen-"
        }
    ], 
    "penta-": [
        {
            "definition": "word-forming element meaning \"five, containing five,\" from Greek penta- (before a vowel pent-), comb. form of pente \"five,\" related to Aeolian pempte (see five), with -a- by analogy of hepta-, ennea-, deka-.", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "penta", 
            "term": "penta-"
        }
    ], 
    "per-": [
        {
            "definition": "word-forming element meaning \"through, throughout; thoroughly; entirely, utterly,\" from Latin preposition per (see per (prep.)).", 
            "languages": [
                "Latin"
            ], 
            "pos": null, 
            "prefix": "per", 
            "term": "per-"
        }
    ], 
    "peri-": [
        {
            "definition": "word-forming element meaning \"around, about, enclosing,\" from Greek peri (prep.) \"around, about, beyond,\" cognate with Sanskrit pari \"around, about, through,\" Latin per, from PIE *per- (1) \"forward, through\" (see per).", 
            "languages": [
                "Greek", 
                "Latin", 
                "PIE", 
                "Sanskrit"
            ], 
            "pos": null, 
            "prefix": "peri", 
            "term": "peri-"
        }
    ], 
    "petro-": [
        {
            "definition": "before vowels petr-, word-forming element used from 19c., from comb. form of Greek petros \"stone,\" petra \"rock\" (see petrous).\r\n", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "petro", 
            "term": "petro-"
        }, 
        {
            "definition": "word-forming element used from mid-20c. to mean \"of or having to do with petroleum products,\" from petroleum.\r\n", 
            "languages": [], 
            "pos": null, 
            "prefix": "petro", 
            "term": "petro-"
        }
    ], 
    "phago-": [
        {
            "definition": "word-forming element meaning \"eating,\" from Greek phago- \"eating, devouring,\" (see -phagous).\r\n", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "phago", 
            "term": "phago-"
        }
    ], 
    "phanero-": [
        {
            "definition": "before vowels phaner-, word-forming element meaning \"visible, manifest,\" from Greek phanero-, comb. form of phaneros \"visible, manifest,\" from phainein \"to show\" (see phantasm).", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "phanero", 
            "term": "phanero-"
        }
    ], 
    "pheno-": [
        {
            "definition": "before vowels phen-, word-forming element in science meaning \"pertaining to or derived from benzene,\" from phene.", 
            "languages": [], 
            "pos": null, 
            "prefix": "pheno", 
            "term": "pheno-"
        }
    ], 
    "philo-": [
        {
            "definition": "before vowels phil-, word-forming element meaning \"loving, fond of, tending to,\" from Greek philo-, comb. form of philos \"dear\" (adj.), \"friend\" (n.), from philein \"to love,\" of unknown origin. Productive of a great many compounds in ancient Greek.", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "philo", 
            "term": "philo-"
        }
    ], 
    "phlebo-": [
        {
            "definition": "word-forming element in medicine meaning \"vein,\" from Greek phlebo-, comb. form of phleps \"vein,\" of uncertain origin.", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "phlebo", 
            "term": "phlebo-"
        }
    ], 
    "phono-": [
        {
            "definition": "word-forming element meaning \"sound, voice,\" from Greek phono-, comb. form of phone \"voice, sound,\" from PIE root *bha- (2) \"to speak, tell, say\" (see fame (n.)).", 
            "languages": [
                "Greek", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "phono", 
            "term": "phono-"
        }
    ], 
    "photo-": [
        {
            "definition": "word-forming element meaning \"light\" or \"photographic\" or \"photoelectric,\" from Greek photo-, comb. form of phos (genitive photos) \"light,\" from PIE root *bha- (1) \"to shine\" (see phantasm).", 
            "languages": [
                "Greek", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "photo", 
            "term": "photo-"
        }
    ], 
    "phreno-": [
        {
            "definition": "before vowels phren-, word-forming element meaning \"mind,\" also \"diaphragm,\" from Greek phreno-, comb. form of phrene properly \"diaphragm, muscle which parts the abdomen from the thorax;\" in Homer extended to \"parts around the heart, breast,\" hence \"heart\" (as a seat of passions), \"mind, seat of thoughts, wits, senses,\" of unknown origin.", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "phreno", 
            "term": "phreno-"
        }
    ], 
    "phyco-": [
        {
            "definition": "word-forming element in science meaning \"seaweed, algae,\" from Latinized comb. form of Greek phykos \"seaweed, sea wrack.\"", 
            "languages": [
                "Greek", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "phyco", 
            "term": "phyco-"
        }
    ], 
    "phyllo-": [
        {
            "definition": "before vowels phyll-, word-forming element meaning \"leaf,\" from Greek phyllo-, comb. form of phyllon \"leaf,\" from PIE *bhol-yo- \"leaf,\" suffixed form of root *bhel- (3) \"to thrive, bloom\" (see folio).", 
            "languages": [
                "Greek", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "phyllo", 
            "term": "phyllo-"
        }
    ], 
    "phylo-": [
        {
            "definition": "before vowels phyl-, word-forming element from comb. form of Greek phylon, phyle \"a tribe,\" also \"a political subdivision in ancient Athens,\" from base of phyein \"to bring forth, produce, make to grow,\" whence also physis \"nature\" (see physic).", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "phylo", 
            "term": "phylo-"
        }
    ], 
    "physico-": [
        {
            "definition": "word-forming element meaning \"physical, physically; natural,\" from Latinized comb. form of Greek physikos \"natural, physical\" (see physic).", 
            "languages": [
                "Greek", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "physico", 
            "term": "physico-"
        }
    ], 
    "physio-": [
        {
            "definition": "word-forming element meaning \"nature, natural, physical,\" from Greek physio-, comb. form of physios \"nature\" (see physic).", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "physio", 
            "term": "physio-"
        }
    ], 
    "phyto-": [
        {
            "definition": "word-forming element meaning \"plant,\" from Greek phyton \"plant,\" literally \"that which has grown,\" from phyein \"to grow\" (see physic).", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "phyto", 
            "term": "phyto-"
        }
    ], 
    "pico-": [
        {
            "definition": "word-forming element used in making names for very small unites of measure, 1915 (formally adopted c.1952 as a scientific prefix meaning \"one trillionth\"), from Spanish pico \"a little over, a small balance,\" literally \"sharp point, beak,\" of Celtic origin (compare Gaulish beccus \"beak\").", 
            "languages": [
                "Celtic", 
                "Gaulish", 
                "Spanish"
            ], 
            "pos": null, 
            "prefix": "pico", 
            "term": "pico-"
        }
    ], 
    "piezo-": [
        {
            "definition": "word-forming element meaning \"pressure,\" from comb. form of Greek piezein \"to press tight, squeeze,\" from PIE *pi-sed-yo- \"to sit upon\" (cognates: Sanskrit pidayati \"presses, oppresses\"), from *pi \"on,\" short for *epi (see epi-) + *sed- (1) \"to sit\" (see sedentary). First in piezometer (1820); in common use in word formation from c.1900.", 
            "languages": [
                "Greek", 
                "PIE", 
                "Sanskrit"
            ], 
            "pos": null, 
            "prefix": "piezo", 
            "term": "piezo-"
        }
    ], 
    "pitheco-": [
        {
            "definition": "before vowels pithec-, word-forming element meaning \"pertaining to an ape or monkey,\" from Greek pithekos \"ape.\"", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "pitheco", 
            "term": "pitheco-"
        }
    ], 
    "plagio-": [
        {
            "definition": "before vowels plagi-, word-forming element meaning \"slanting, oblique,\" from comb. form of Greek plagios \"oblique, slanting,\" from plagos \"side,\" from PIE *plag- \"flat, spread,\" from *plak- (1) \"to be flat\" (see placenta).", 
            "languages": [
                "Greek", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "plagio", 
            "term": "plagio-"
        }
    ], 
    "plani-": [
        {
            "definition": "word-forming element meaning \"level, plane,\" from Latin plani-, from planus \"flat, level\" (see plane (n.1)).", 
            "languages": [
                "Latin"
            ], 
            "pos": null, 
            "prefix": "plani", 
            "term": "plani-"
        }
    ], 
    "plano-": [
        {
            "definition": "alternative form of Latin plani- \"flat, level,\" but also used in sciences as a comb. form of Greek planos \"wandering\" (see planet).", 
            "languages": [
                "Greek", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "plano", 
            "term": "plano-"
        }
    ], 
    "pleio-": [
        {
            "definition": "also pleo-, word-forming element meaning \"more,\" from comb. form of Greek pleion \"larger, greater in quantity, the more part, very many\" (comp. of polys \"much\"), from PIE *ple- (cognates: Latin plere \"to fill,\" plebes, \"the populace, the common people;\" Greek plethein \"be full,\" pleres \"full\"), possibly a variant of *pele- (1) \"to fill\" (see poly-). ", 
            "languages": [
                "Greek", 
                "Latin", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "pleio", 
            "term": "pleio-"
        }
    ], 
    "pleo-": [
        {
            "definition": "see pleio-.", 
            "languages": [], 
            "pos": null, 
            "prefix": "pleo", 
            "term": "pleo-"
        }
    ], 
    "pleuro-": [
        {
            "definition": "before vowels pleur-, word-forming element meaning \"pertaining to the side; pertaining to the pleura,\" from comb. form of Greek pleura (see pleura).", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "pleuro", 
            "term": "pleuro-"
        }
    ], 
    "plio-": [
        {
            "definition": "word-forming element, Latinate form of pleio-.", 
            "languages": [
                "Latin"
            ], 
            "pos": null, 
            "prefix": "plio", 
            "term": "plio-"
        }
    ], 
    "plumbo-": [
        {
            "definition": "word-forming element meaning \"lead\" (the metal), from comb. form of Latin plumbum \"lead\" (see plumb (n.)).", 
            "languages": [
                "Latin"
            ], 
            "pos": null, 
            "prefix": "plumbo", 
            "term": "plumbo-"
        }
    ], 
    "pluri-": [
        {
            "definition": "word-forming element meaning \"more than one, several, many,\" from Latin pluri-, from stem of plus (genitive pluris); see plus.", 
            "languages": [
                "Latin"
            ], 
            "pos": null, 
            "prefix": "pluri", 
            "term": "pluri-"
        }
    ], 
    "pn-": [
        {
            "definition": "consonant sound in some English words derived from Greek. The p- typically is silent in English but pronounced in French, German, Spanish, etc.", 
            "languages": [
                "English", 
                "French", 
                "German", 
                "Greek", 
                "Spanish"
            ], 
            "pos": null, 
            "prefix": "pn", 
            "term": "pn-"
        }
    ], 
    "pneumato-": [
        {
            "definition": "before vowels pneumat-, word-forming element meaning \"wind, air, spirit, presence of air,\" from comb. form of Greek pneuma (genitive pneumatos); see pneuma.", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "pneumato", 
            "term": "pneumato-"
        }
    ], 
    "pneumo-": [
        {
            "definition": "before vowels pneum-, word-forming element meaning \"lung,\" from comb. form of Greek pneumon (see pneumonia).", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "pneumo", 
            "term": "pneumo-"
        }
    ], 
    "pneumono-": [
        {
            "definition": "before vowels pneumon-, word-forming element meaning \"lung,\" from comb. form of Greek pneumon (genitive pneumonos \"lung\" (see pneumonia).", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "pneumono", 
            "term": "pneumono-"
        }
    ], 
    "pogon-": [
        {
            "definition": "word-forming element from comb. form of Greek pogon \"the beard.\" Used in Pogonophile; pogonophobia.", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "pogon", 
            "term": "pogon-"
        }
    ], 
    "politico-": [
        {
            "definition": "word-forming element meaning \"political and,\" from Latinized comb. form of Greek politikos (see political).", 
            "languages": [
                "Greek", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "politico", 
            "term": "politico-"
        }
    ], 
    "poly-": [
        {
            "definition": "word-forming element meaning \"many, much, multi-, one or more,\" from Greek poly-, combining form of polys \"much\" (plural polloi); cognate with Latin plus, from PIE root *pele- (1) \"to fill,\" with derivatives referring to multitudinousness or abundance (cognates: Sanskrit purvi \"much,\" prayah \"mostly;\" Avestan perena-, Old Persian paru \"much;\" Greek plethos \"people, multitude, great number,\" polys \"much, plenty,\" ploutos \"wealth;\" Lithuanian pilus \"full, abundant;\" Old Church Slavonic plunu; Gothic filu \"much,\" Old Norse fjöl-, Old English fela, feola \"much, many;\" Old English folgian; Old Irish lan, Welsh llawn \"full;\" Old Irish il, Welsh elu \"much\"); probably related to root *pele- (2) \"to spread.\"\r\n\r\nProperly used in compounds only with words of Greek origin. In chemical names, usually indicating a compound with a large number of atoms or molecules of the same kind (such as polymer).", 
            "languages": [
                "English", 
                "Gothic", 
                "Greek", 
                "Latin", 
                "Lithuanian", 
                "Old Church Slavonic", 
                "Old Irish", 
                "Old Norse", 
                "Old Persian", 
                "PIE", 
                "Sanskrit"
            ], 
            "pos": null, 
            "prefix": "poly", 
            "term": "poly-"
        }
    ], 
    "post-": [
        {
            "definition": "word-forming element meaning \"after,\" from Latin post \"behind, after, afterward,\" from *pos-ti (cognates: Arcadian pos, Doric poti \"toward, to, near, close by;\" Old Church Slavonic po \"behind, after,\" pozdu \"late;\" Lithuanian pas \"at, by\"), from PIE *apo- (cognates: Greek apo \"from,\" Latin ab \"away from\" see apo-).", 
            "languages": [
                "Greek", 
                "Latin", 
                "Lithuanian", 
                "Old Church Slavonic", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "post", 
            "term": "post-"
        }
    ], 
    "potamo-": [
        {
            "definition": "word-forming element meaning \"river,\" from comb. form of Greek potamos \"river,\" perhaps literally \"rushing water,\" from PIE *pet- \"to rush, to fly\" (see petition).", 
            "languages": [
                "Greek", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "potamo", 
            "term": "potamo-"
        }
    ], 
    "prae-": [
        {
            "definition": "word-forming element meaning \"before,\" from Latin prae (adv.) \"before,\" from PIE *prai-, *prei-, from root *per- (1) \"forward, through\" (see per; also see pre-). Reduced to pre- in Medieval Latin. According to OED the full form prae- in Modern English appears \"usually only in words that are still regarded as Latin, ... or that are terms of classical antiquity ....\"", 
            "languages": [
                "Latin", 
                "Medieval Latin", 
                "Modern English", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "prae", 
            "term": "prae-"
        }
    ], 
    "praeter-": [
        {
            "definition": "see preter-.", 
            "languages": [], 
            "pos": null, 
            "prefix": "praeter", 
            "term": "praeter-"
        }
    ], 
    "pre-": [
        {
            "definition": "word-forming element meaning \"before,\" from Old French pre- and Medieval Latin pre-, both from Latin prae (adverb and preposition) \"before in time or place,\" from PIE *peri- (cognates: Oscan prai, Umbrian pre, Sanskrit pare \"thereupon,\" Greek parai \"at,\" Gaulish are- \"at, before,\" Lithuanian pre \"at,\" Old Church Slavonic pri \"at,\" Gothic faura, Old English fore \"before\"), extended form of root *per- (1) \"beyond\" (see per).\r\n\r\nThe Latin word was active in forming verbs. Also see prae-. Sometimes in Middle English muddled with words in pro- or per-.", 
            "languages": [
                "English", 
                "Gaulish", 
                "Gothic", 
                "Greek", 
                "Latin", 
                "Lithuanian", 
                "Medieval Latin", 
                "Middle English", 
                "Old Church Slavonic", 
                "Old French", 
                "Oscan", 
                "PIE", 
                "Sanskrit"
            ], 
            "pos": null, 
            "prefix": "pre", 
            "term": "pre-"
        }
    ], 
    "presby-": [
        {
            "definition": "word-forming element meaning \"old,\" from Greek presby-, combining form of presbys \"elder, old man,\"  possibly originally \"one who leads the cattle,\" from *pres- \"before,\" extended form of *pre- (see per) + root of bous \"cow.\" Watkins, however, has it from PIE *pres-gwu- \"going before,\" with second element from root *gw-u- \"going\" (see venue).", 
            "languages": [
                "Greek", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "presby", 
            "term": "presby-"
        }
    ], 
    "preter-": [
        {
            "definition": "also praeter-, word-forming element meaning \"beyond,\" from Latin praeter (adverb and preposition) \"beyond, before, above, more than,\" properly comparative of prae \"before\" (see pre-).\r\n", 
            "languages": [
                "Latin"
            ], 
            "pos": null, 
            "prefix": "preter", 
            "term": "preter-"
        }
    ], 
    "pro-": [
        {
            "definition": "word-forming element meaning \"forward, forth, toward the front\" (as in proclaim, proceed); \"beforehand, in advance\" (prohibit, provide); \"taking care of\" (procure); \"in place of, on behalf of\" (proconsul, pronoun); from Latin pro \"on behalf of, in place of, before, for, in exchange for, just as,\" which also was used as a prefix.\r\n\r\nAlso in some cases from cognate Greek pro \"before, in front of, sooner,\" which also was used in Greek as a prefix (as in problem). Both the Latin and Greek words are from PIE *pro- (cognates: Sanskrit pra- \"before, forward, forth;\" Gothic faura \"before,\" Old English fore \"before, for, on account of,\" fram \"forward, from;\" Old Irish roar \"enough\"), extended form of root *per- (1) \"forward, through\" (see per).\r\n\r\nThe common modern sense \"in favor of, favoring\" (pro-independence, pro-fluoridation, pro-Soviet, etc.) was not in classical Latin and is attested in English from early 19c.", 
            "languages": [
                "English", 
                "Gothic", 
                "Greek", 
                "Latin", 
                "Old Irish", 
                "PIE", 
                "Sanskrit"
            ], 
            "pos": null, 
            "prefix": "pro", 
            "term": "pro-"
        }
    ], 
    "protero-": [
        {
            "definition": "before vowels proter-, word-forming element meaning \"former, earlier,\" from comb. form of Greek proteros \"before, former, anterior,\" from PIE *pro-, from root *per- (1) \"forward, through\" (see per).", 
            "languages": [
                "Greek", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "protero", 
            "term": "protero-"
        }
    ], 
    "proto-": [
        {
            "definition": "before vowels prot-, word-forming element meaning \"first, source, parent, preceding, earliest form, original, basic,\" from Greek proto-, from protos \"first,\" from PIE *pre-, from root *per- (1) \"forward, through\" (see per).", 
            "languages": [
                "Greek", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "proto", 
            "term": "proto-"
        }
    ], 
    "psammo-": [
        {
            "definition": "word-forming element meaning \"sand,\" from comb. form of Greek psammos \"sand,\" related to psamathos (see sand (n.)). Related: Psammic; psammite.", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "psammo", 
            "term": "psammo-"
        }
    ], 
    "pseudo-": [
        {
            "definition": "often before vowels pseud-, word-forming element meaning \"false; feigned; erroneous; in appearance only; resembling,\" from Greek pseudo-, comb. form of pseudes \"false, lying; falsely; deceived,\" or pseudos \"falsehood, untruth, a lie,\" both from pseudein \"to deceive, cheat by lies.\"\r\n\r\nProductive in compound formation in ancient Greek (such as pseudodidaskalos \"false teacher,\" pseudokyon \"a sham cynic,\" pseudologia \"a false speech,\" pseudoparthenos \"pretended virgin\"), it began to be used with native words in Middle English.", 
            "languages": [
                "Greek", 
                "Middle English"
            ], 
            "pos": null, 
            "prefix": "pseudo", 
            "term": "pseudo-"
        }
    ], 
    "psilo-": [
        {
            "definition": "before vowels psil-, word-forming element meaning \"stripped, bare,\" from Greek psilos \"bare, naked; mere,\" perhaps akin to psen \"to rub,\" and both or either perhaps from PIE root *bhes- \"to rub\" (source also of Greek psamathos \"sand;\" see sand (n.)).", 
            "languages": [
                "Greek", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "psilo", 
            "term": "psilo-"
        }
    ], 
    "psycho-": [
        {
            "definition": "word-forming element meaning \"mind, mental; spirit, unconscious,\" from Greek psykho-, combining form of psykhe (see psyche). It also was used to form compounds in Greek, such as psychopates \"soul-beguiling.\"", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "psycho", 
            "term": "psycho-"
        }
    ], 
    "psychro-": [
        {
            "definition": "word-forming element meaning \"cold,\" from Latinized form of Greek psykhros \"cold,\" from psykhrein \"blow, make cool or cold,\" from the same root as psyche.", 
            "languages": [
                "Greek", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "psychro", 
            "term": "psychro-"
        }
    ], 
    "pt-": [
        {
            "definition": "An initial consonant combination common in Greek; the p- is typically silent in English words that have it but pronounced in French, German, etc.", 
            "languages": [
                "English", 
                "French", 
                "German", 
                "Greek"
            ], 
            "pos": null, 
            "prefix": "pt", 
            "term": "pt-"
        }
    ], 
    "ptero-": [
        {
            "definition": "before vowels pter-, word-forming element in science meaning \"feather; wing,\" from comb. form of Greek pteron \"wing,\" from PIE *pt-ero- (cognates: Sanskrit patram \"wing, feather,\" Old Church Slavonic pero \"pen,\" Old Norse fjöðr, Old English feðer), from root *pet- \"to rush; to fly\" (see petition (n.))", 
            "languages": [
                "English", 
                "Greek", 
                "Old Church Slavonic", 
                "Old Norse", 
                "PIE", 
                "Sanskrit"
            ], 
            "pos": null, 
            "prefix": "ptero", 
            "term": "ptero-"
        }
    ], 
    "pur-": [
        {
            "definition": "Middle English and Anglo-French perfective prefix, corresponding to Old French por-, pur- (Modern French pour), from Vulgar Latin *por-, variation of Latin pro- \"before, for\" (see pro-). This is the earliest form of the prefix in English, and it is retained in some words, but in many others it has reverted to Latinate pro-.", 
            "languages": [
                "Anglo-French", 
                "English", 
                "French", 
                "Latin", 
                "Middle English", 
                "Old French", 
                "Vulgar Latin"
            ], 
            "pos": null, 
            "prefix": "pur", 
            "term": "pur-"
        }
    ], 
    "pycno-": [
        {
            "definition": "before vowels pycn-, word-forming element meaning \"close, thick, dense,\" from comb. form of Greek pyknos \"thick, dense.\" Sometimes via German as pykno-.", 
            "languages": [
                "German", 
                "Greek"
            ], 
            "pos": null, 
            "prefix": "pycno", 
            "term": "pycno-"
        }
    ], 
    "pyelo-": [
        {
            "definition": "before vowels pyel-, medical word-forming element, 19c., from comb. form of Greek pyelos \"oblong trough, bathing-tub,\" used for \"pelvis.\"", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "pyelo", 
            "term": "pyelo-"
        }
    ], 
    "pyo-": [
        {
            "definition": "word-forming element meaning \"pus,\" from comb. form of Greek puon \"pus\" (see pus).", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "pyo", 
            "term": "pyo-"
        }
    ], 
    "pyro-": [
        {
            "definition": "before vowels pyr-, word-forming element form meaning \"fire,\" from Greek pyro-, combining form of pyr (genitive pyros) \"fire, funeral fire,\" also symbolic of terrible things, rages, \"rarely as an image of warmth and comfort\" [Liddell & Scott], from PIE root *paəwr- \"fire\" (see fire (n.)). Pyriphlegethon, literally \"fire-blazing,\" was one of the rivers of Hell.", 
            "languages": [
                "Greek", 
                "PIE", 
                "Scot."
            ], 
            "pos": null, 
            "prefix": "pyro", 
            "term": "pyro-"
        }
    ], 
    "qu-": [
        {
            "definition": "see Q.", 
            "languages": [], 
            "pos": null, 
            "prefix": "qu", 
            "term": "qu-"
        }
    ], 
    "quadri-": [
        {
            "definition": "before vowels quad- (before -p- often quadru-, from an older form in Latin), word-forming element meaning \"four, four times, having four, consisting of four,\" from Latin quadri-, related to quattor \"four\" (see four).", 
            "languages": [
                "Latin"
            ], 
            "pos": null, 
            "prefix": "quadri", 
            "term": "quadri-"
        }
    ], 
    "quadru-": [
        {
            "definition": "word-forming element meaning \"four, having four, consisting of four,\" variant of quadri-, especially before -p-, from an older form of the element, which perhaps was influenced later by tri-.", 
            "languages": [], 
            "pos": null, 
            "prefix": "quadru", 
            "term": "quadru-"
        }
    ], 
    "quasi-": [
        {
            "definition": "word-forming element used since 18c. (but most productively in 20c.) and typically meaning \"kind of, resembling, like but not really, as if;\" from Latin quasi \"as if, as it were\" (see quasi).", 
            "languages": [
                "Latin"
            ], 
            "pos": null, 
            "prefix": "quasi", 
            "term": "quasi-"
        }
    ], 
    "quinque-": [
        {
            "definition": "before vowels quinqu-, word-forming element meaning \"five, having five,\" from Latin quinque \"five,\" by assimilation from PIE *penkwe (see five).", 
            "languages": [
                "Latin", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "quinque", 
            "term": "quinque-"
        }
    ], 
    "rachio-": [
        {
            "definition": "also rhachio-, before vowels rachi-, word-forming element meaning \"spinal,\" from Greek rhakhis \"spine, ridge, rib of a leaf.\" Compare Greek rhakhos \"thorn hedge.\"", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "rachio", 
            "term": "rachio-"
        }
    ], 
    "radio-": [
        {
            "definition": "word-forming element meaning 1. \"ray, ray-like\" (see radius); 2. \"radial, radially\" (see radial (adj.)); 3. \"by means of radiant energy\" (see radiate (v.)); 4. \"radioactive\" (see radioactive); 5. \"by radio\" (see radio (n.)).", 
            "languages": [], 
            "pos": null, 
            "prefix": "radio", 
            "term": "radio-"
        }
    ], 
    "re-": [
        {
            "definition": "word-forming element meaning \"back to the original place; again, anew, once more,\" also with a sense of \"undoing,\" c. 1200, from Old French and directly from Latin re- \"again, back, anew, against,\" \"Latin combining form conceivably from Indo-European *wret-, metathetical variant of *wert- \"to turn\" [Watkins]. Often merely intensive, and in many of the older borrowings from French and Latin the precise sense of re- is lost in secondary senses or weakened beyond recognition. OED writes that it is \"impossible to attempt a complete record of all the forms resulting from its use,\" and adds that \"The number of these is practically infinite ....\" The Latin prefix became red- before vowels and h-, as in redact, redeem, redolent, redundant.", 
            "languages": [
                "French", 
                "Indo-European", 
                "Latin", 
                "Old French"
            ], 
            "pos": null, 
            "prefix": "re", 
            "term": "re-"
        }
    ], 
    "recto-": [
        {
            "definition": "word-forming element meaning \"pertaining to or involving the rectum,\" before vowels rect-, from comb. form of rectum.", 
            "languages": [], 
            "pos": null, 
            "prefix": "recto", 
            "term": "recto-"
        }
    ], 
    "retro-": [
        {
            "definition": "word-forming element meaning \"backwards; behind,\" from Latin retro (prep.) \"backward, back, behind,\" also of time, \"formerly, in past times,\" probably originally the ablative form of *reteros, based on re- \"back\" (see re-).\r\n\r\nL. retro stands to re- as intro, \"in, within\"; to in, \"in,\" and as citro, \"hither,\" stands to cis, \"on this side.\" [Klein]\r\nCommon in combinations in post-classical Latin (the classical equivalent was post-). Active in English as a word-forming element from mid-20c. ", 
            "languages": [
                "English", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "retro", 
            "term": "retro-"
        }
    ], 
    "rh-": [
        {
            "definition": "consonantal digraph used in Latin (and thus in English words from Latin) to represent Greek initial aspirated -r-.", 
            "languages": [
                "English", 
                "Greek", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "rh", 
            "term": "rh-"
        }
    ], 
    "rheo-": [
        {
            "definition": "word-forming element meaning \"current of a stream,\" from Greek rheos \"a flowing, stream, current,\" from PIE root *sreu-; see rheum.", 
            "languages": [
                "Greek", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "rheo", 
            "term": "rheo-"
        }
    ], 
    "rhino-": [
        {
            "definition": "before vowels rhin-, word-forming element meaning \"nose, of the nose,\" from Greek  rhino-, comb. form of rhis \"nose,\" which is of uncertain origin.", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "rhino", 
            "term": "rhino-"
        }
    ], 
    "sacro-": [
        {
            "definition": "word-forming element meaning \"of or involving the sacrum, the bone at the base of the spine. E.g. sacro-iliac.", 
            "languages": [], 
            "pos": null, 
            "prefix": "sacro", 
            "term": "sacro-"
        }
    ], 
    "sarco-": [
        {
            "definition": "before vowels sarc-, word-forming element meaning \"flesh, fleshy, of the flesh,\" from Latinized form of Greek sark-, comb. form of sarx \"flesh\" (see sarcasm).", 
            "languages": [
                "Greek", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "sarco", 
            "term": "sarco-"
        }
    ], 
    "sch-": [
        {
            "definition": "this letter group can represent five distinct sounds in English; it first was used by Middle English writers to render Old English sc-, a sound now generally pronounced (and spelled) \"-sh-.\" Sometimes it was miswritten for -ch-. It also was taken in from German (schnapps) and Yiddish (schlemiel). In words derived from classical languages, it represents Latin sch-, Greek skh-, but in some of these words the spelling is a restoration and the pronunciation does not follow it (as in schism).", 
            "languages": [
                "English", 
                "German", 
                "Greek", 
                "Latin", 
                "Middle English"
            ], 
            "pos": null, 
            "prefix": "sch", 
            "term": "sch-"
        }
    ], 
    "schizo-": [
        {
            "definition": "word-forming element meaning \"division; split, cleavage,\" from Latinized form of Greek skhizo-, comb. form of skhizein \"to split, cleave, part, separate,\" from PIE root *skei- \"to cut, separate, divide, part, split\" (see shed (v.)).", 
            "languages": [
                "Greek", 
                "Latin", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "schizo", 
            "term": "schizo-"
        }
    ], 
    "schm-": [
        {
            "definition": "substituted for the initial sound of a word and reduplicated with it to convey derision (as in \"Oedipus schmoedipus\" in the punchline of the old joke about the Jewish mother and the psychiatrist), 1929, from the numerous Yiddish words that begin with this sound.", 
            "languages": [], 
            "pos": null, 
            "prefix": "schm", 
            "term": "schm-"
        }
    ], 
    "sclero-": [
        {
            "definition": "before vowels scler-, word-forming element meaning \"hard,\" from Latinized form of Greek sklero-, comb. form of skleros \"hard,\" related to skellein \"to dry up, parch,\" from PIE *skle-ro-, from root *skele- \"to parch, wither.\"", 
            "languages": [
                "Greek", 
                "Latin", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "sclero", 
            "term": "sclero-"
        }
    ], 
    "se-": [
        {
            "definition": "word-forming element, from Latin se-, collateral form of sed- \"without, apart, aside, on one's own,\" related to sed, Latin reflexive pronoun (accusative and ablative), from PIE *sed-, extended form of root *s(w)e-, pronoun of the third person and reflexive (source also of German sich; see idiom).", 
            "languages": [
                "German", 
                "Latin", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "se", 
            "term": "se-"
        }
    ], 
    "seismo-": [
        {
            "definition": "word-forming element meaning \"earthquake,\" from comb. form of Greek seismos \"a shaking, shock; an earthquake,\" from seiein \"to shake,\" from PIE root *twei- \"to agitate, shake, toss.\"", 
            "languages": [
                "Greek", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "seismo", 
            "term": "seismo-"
        }
    ], 
    "self-": [
        {
            "definition": "word forming element indicating \"oneself,\" also \"automatic,\" from Old English use of self (pron.) in compounds, such as selfbana \"suicide,\" selflice \"self-love, pride, vanity, egotism,\" selfwill \"free will.\"", 
            "languages": [
                "English"
            ], 
            "pos": null, 
            "prefix": "self", 
            "term": "self-"
        }
    ], 
    "semi-": [
        {
            "definition": "before vowels sem-, word-forming element meaning \"half, part, partly; partial, imperfect; twice,\" from Latin semi- \"half,\" from PIE *semi- \"half\" (cognates: Sanskrit sami \"half,\" Greek hemi- \"half,\" Old English sam-, Gothic sami- \"half\").\r\n\r\nOld English cognate sam- was used in such compounds as samhal \"poor health,\" literally \"half-whole;\" samsoden \"half-cooked,\" figuratively \"stupid\" (compare half-baked); samcucu \"half-dead,\" literally \"half-alive;\" and the last survivor of the group, sandblind \"dim-sighted\" (q.v.). Common in Latin (as in semi-gravis \"half-drunk,\" semi-hora \"half hour,\" semi-mortuus \"half-dead,\" semi-nudus \"half-naked,\" semi-vir \"half-man, hermaphrodite\"). The Latin-derived form in English has been active in forming native words since 15c.", 
            "languages": [
                "English", 
                "Gothic", 
                "Greek", 
                "Latin", 
                "PIE", 
                "Sanskrit"
            ], 
            "pos": null, 
            "prefix": "semi", 
            "term": "semi-"
        }
    ], 
    "semi-demi-": [
        {
            "definition": "word-forming element meaning \"sixty-fourth part,\" 1660s; see semi- + demi-.", 
            "languages": [], 
            "pos": null, 
            "prefix": "semi-demi", 
            "term": "semi-demi-"
        }
    ], 
    "semper-": [
        {
            "definition": "word-forming element meaning \"always, ever,\" from Latin semper \"always, ever, at all times, continuously\" (literally \"once for all\"), from PIE *sem- (1) \"one, as one, together\" (cognates: Latin semel \"once,\" similis \"like;\" see same).", 
            "languages": [
                "Latin", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "semper", 
            "term": "semper-"
        }
    ], 
    "sept-": [
        {
            "definition": "see septi-.", 
            "languages": [], 
            "pos": null, 
            "prefix": "sept", 
            "term": "sept-"
        }
    ], 
    "septem-": [
        {
            "definition": "word-forming element meaning \"seven,\" from Latin septem-, from septem \"seven\" (see seven).", 
            "languages": [
                "Latin"
            ], 
            "pos": null, 
            "prefix": "septem", 
            "term": "septem-"
        }
    ], 
    "septi-": [
        {
            "definition": "before vowels sept-, word-forming element meaning \"seven,\" from Latin septem (see seven).", 
            "languages": [
                "Latin"
            ], 
            "pos": null, 
            "prefix": "septi", 
            "term": "septi-"
        }
    ], 
    "sesqui-": [
        {
            "definition": "word-forming element, from Latin sesqui- \"one-half more,\" contraction of *semis-que- \"a half in addition,\" from semis \"a half\" (see semi-) + -que \"and,\" from PIE *kwe-.", 
            "languages": [
                "Latin", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "sesqui", 
            "term": "sesqui-"
        }
    ], 
    "sh-": [
        {
            "definition": "sound represented in Old English by -sc- (fisc \"fish\"), which originally was pronounced \"-sk-\" but which by late Old English had softened to \"-sh-.\" Modern English words with -sc- mostly are imports (generally Scandinavian).\r\n\r\nThe \"sh\" sound did not exist in Old French, therefore French scribes after the Norman conquest often represented it with -ssh- in medial and final positions, and sch- in initial positions (schape, schamful, schaft for shape, shameful, shaft). But the spelling -sh- has been standard since Caxton, probably as a worn-down form of Middle English -sch-.\r\n\r\nIn some East Anglian texts from 14c.-15c., x- is used (xal, xulde for shall, should), which would have given the language a very different look had it prevailed, but the London-based sh- ended up as the standard form. The same Germanic sound has become, by natural evolution, modern German and Dutch sch-, Scandinavian sk-.", 
            "languages": [
                "Anglian", 
                "Dutch", 
                "English", 
                "French", 
                "German", 
                "Germanic", 
                "Middle English", 
                "Modern English", 
                "Old French", 
                "Scandinavian"
            ], 
            "pos": null, 
            "prefix": "sh", 
            "term": "sh-"
        }
    ], 
    "sialo-": [
        {
            "definition": "before vowels sial-, word-forming element meaning \"saliva,\" from comb. form of Greek sialon \"saliva.\"", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "sialo", 
            "term": "sialo-"
        }
    ], 
    "socio-": [
        {
            "definition": "word-forming element meaning \"social, of society; social and,\" also \"having to do with sociology,\" from combining form of Latin socius \"companion, ally, associate, fellow, sharer\" (see social (adj.)). Common in compounds since c.1880.", 
            "languages": [
                "Latin"
            ], 
            "pos": null, 
            "prefix": "socio", 
            "term": "socio-"
        }
    ], 
    "somato-": [
        {
            "definition": "before vowels somat-, word-forming element meaning \"the body of an organism,\" from comb. form of Greek soma (genitive somatos) \"the body, a human body dead or living, body as opposed to spirit; material substance; mass; a person, human being; the whole body or mass of anything,\" of uncertain origin.", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "somato", 
            "term": "somato-"
        }
    ], 
    "somni-": [
        {
            "definition": "before vowels somn-, word-forming element meaning \"sleep,\" from comb. form of Latin somnus (see Somnus).", 
            "languages": [
                "Latin"
            ], 
            "pos": null, 
            "prefix": "somni", 
            "term": "somni-"
        }
    ], 
    "spectro-": [
        {
            "definition": "word-forming element meaning \"of or by a spectroscope,\" also \"of radiant energy,\" from comb. form of spectrum.", 
            "languages": [], 
            "pos": null, 
            "prefix": "spectro", 
            "term": "spectro-"
        }
    ], 
    "spermato-": [
        {
            "definition": "before vowels spermat-, word-forming element meaning \"seed, sperm,\" used from 1880s in scientific compounds, from Greek sperma (genitive spermatos \"seed\" of an animal or plant; see sperm).", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "spermato", 
            "term": "spermato-"
        }
    ], 
    "spheno-": [
        {
            "definition": "before vowels sphen-, word-forming element meaning \"wedge,\" from comb. form of Greek sphen \"a wedge,\" probably cognate with Old Norse spann \"splinter,\" Old English spon \"chip of wood\" (see spoon (n.)).", 
            "languages": [
                "English", 
                "Greek", 
                "Old Norse"
            ], 
            "pos": null, 
            "prefix": "spheno", 
            "term": "spheno-"
        }
    ], 
    "sphygmo-": [
        {
            "definition": "word-forming element meaning \"pulse,\" from comb. form of Greek sphygmos \"a pulse,\" from sphyzein \"to throb, pulse, beat.\"", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "sphygmo", 
            "term": "sphygmo-"
        }
    ], 
    "spiro-": [
        {
            "definition": "word-forming element meaning \"twisted, spiraled, whorled,\" from comb. form of Latin spira \"a coil, twist,\" from Greek speira (see spiral (adj.)).", 
            "languages": [
                "Greek", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "spiro", 
            "term": "spiro-"
        }
    ], 
    "splanchno-": [
        {
            "definition": "before vowels splanchn-, word-forming element meaning \"viscera,\" from  Greek splankhnon, usually in plural, splankhna \"the innards, entrails\" (including heart, lungs, liver, kidneys); related to splen (see spleen).", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "splanchno", 
            "term": "splanchno-"
        }
    ], 
    "spleno-": [
        {
            "definition": "before vowels splen-, word-forming element meaning \"spleen, spleen and,\" from comb. form of Greek splen (see spleen).", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "spleno", 
            "term": "spleno-"
        }
    ], 
    "spondylo-": [
        {
            "definition": "before vowels spondyl-, comb form meaning \"vertebrae,\" from Greek spondylos \"a vertebra,\" in plural \"the backbone,\" variant of sphondylos, of uncertain origin.", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "spondylo", 
            "term": "spondylo-"
        }
    ], 
    "sporo-": [
        {
            "definition": "before vowels spor-, word-forming element meaning \"spore,\" from comb. form of Greek spora \"a seed, a sowing,\" related to sporas \"scattered, dispersed,\" sporos \"sowing,\" and speirein \"to sow,\" from PIE *spor-, variant of root *sper- (4) \"to strew\" (see sprout (v.)).", 
            "languages": [
                "Greek", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "sporo", 
            "term": "sporo-"
        }
    ], 
    "steno-": [
        {
            "definition": "before vowels sten-, word-forming element meaning \"narrow,\" from comb. form of Greek stenos \"narrow, strait,\" as a noun \"straits of the sea, narrow strip of land,\" also metaphorically, \"close, confined; scanty, petty,\" from PIE *sten- \"narrow.\"", 
            "languages": [
                "Greek", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "steno", 
            "term": "steno-"
        }
    ], 
    "step-": [
        {
            "definition": "Old English steop-, with connotations of \"loss,\" in combinations like steopcild \"orphan,\" related to astiepan, bestiepan \"to bereave, to deprive of parents or children,\" from Proto-Germanic *steupa- \"bereft\" (cognates: Old Frisian stiap-, Old Norse stjup-, Swedish styv-, Middle Low German stef-, Dutch stief-, Old High German stiof-, German stief-), literally \"pushed out,\" from PIE *steup-, from root *(s)teu- (1) \"to push, stick, knock,\" with derivatives referring to fragments (see steep (adj.)). Barnhart suggests the forms in -f- are by assimilation of the first sound in following words for \"father.\"\r\n\r\nEtymologically, a stepfather or stepmother is one who becomes father or mother to an orphan, but the notion of orphanage faded in 20c. and came to denote simply relation through marriage. For sense evolution, compare Latin privignus \"stepson,\" related to privus \"deprived.\" Compare orphan (n.).", 
            "languages": [
                "Dutch", 
                "English", 
                "German", 
                "Latin", 
                "Middle Low German", 
                "Old Frisian", 
                "Old High German", 
                "Old Norse", 
                "PIE", 
                "Proto-Germanic", 
                "Swedish"
            ], 
            "pos": null, 
            "prefix": "step", 
            "term": "step-"
        }
    ], 
    "stereo-": [
        {
            "definition": "before vowels stere-, word-forming element meaning \"solid, firm; three-dimensional; stereophonic,\" from comb. form of Greek stereos \"solid,\" from PIE *ster- (1) \"stiff, rigid, firm, strong\" (cognates: Greek steresthai \"be deprived of,\" steira \"sterile,\" sterphnios \"stiff, rigid,\" sterphos \"hide, skin;\" Latin sterilis \"barren, unproductive;\" Sanskrit sthirah \"hard, firm,\" starih \"a barren cow;\" Persian suturg \"strong;\" Lithuanian storas \"thick,\" stregti \"to become frozen;\" Old Church Slavonic strublu \"strong, hard,\" sterica \"a barren cow,\" staru \"old\" (hence Russian stary \"old\"); Gothic stairo \"barren;\" Old Norse stirtla \"a barren cow,\" Old English starian \"to stare,\" stearc \"stiff, strong, rigid,\" steorfan \"to die,\" literally \"become stiff,\" styrne \"severe, strict\").", 
            "languages": [
                "English", 
                "Gothic", 
                "Greek", 
                "Latin", 
                "Lithuanian", 
                "Old Church Slavonic", 
                "Old Norse", 
                "PIE", 
                "Persian", 
                "Russian", 
                "Sanskrit"
            ], 
            "pos": null, 
            "prefix": "stereo", 
            "term": "stereo-"
        }
    ], 
    "strato-": [
        {
            "definition": "before vowels strat-, word-forming element referring to layers or layering, also stratus clouds, from comb. form of Latin stratus \"a spreading\" (see stratum).", 
            "languages": [
                "Latin"
            ], 
            "pos": null, 
            "prefix": "strato", 
            "term": "strato-"
        }
    ], 
    "strepto-": [
        {
            "definition": "word-forming element used in science to mean \"twisted,\" from Latinized comb. form of Greek streptos \"twisted, easy to bend, pliant,\" verbal adjective of strephein \"to turn, twist,\" from PIE *streb(h)- \"to wind, turn\" (see strophe).", 
            "languages": [
                "Greek", 
                "Latin", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "strepto", 
            "term": "strepto-"
        }
    ], 
    "sub-": [
        {
            "definition": "word-forming element meaning \"under, beneath; behind; from under; resulting from further division,\" from Latin preposition sub \"under, below, beneath, at the foot of,\" also \"close to, up to, towards;\" of time, \"within, during;\" figuratively \"subject to, in the power of;\" also \"a little, somewhat\" (as in sub-horridus \"somewhat rough\").\r\n\r\nThis is said to be from PIE *(s)up- (perhaps representing *ex-upo-), a variant form of the root *upo- \"from below,\" hence \"turning upward, upward, up, up from under, over, beyond\" (cognates: Sanskrit upa \"near, under, up to, on,\" Greek hypo \"under,\" Gothic iup, Old Norse, Old English upp \"up, upward,\" Hittite up-zi \"rises\"). The Latin word also was used as a prefix and in various combinations.\r\n\r\nIn Latin assimilated to following -c-, -f-, -g-, -p-, and often -r- and -m-. In Old French the prefix appears in the full Latin form only \"in learned adoptions of old Latin compounds\" [OED], and in popular use it was represented by sous-, sou-; as in French souvenir from Latin subvenire, souscrire (Old French souzescrire) from subscribere, etc.\r\n\r\nThe original meaning is now obscured in many words from Latin (suggest, suspect, subject, etc.). The prefix is active in Modern English, sometimes meaning \"subordinate\" (as in subcontractor); \"inferior\" (17c., as in subhuman); \"smaller\" (18c.); \"a part or division of\" (c. 1800, as in subcontinent).", 
            "languages": [
                "English", 
                "French", 
                "Gothic", 
                "Greek", 
                "Latin", 
                "Modern English", 
                "Old French", 
                "Old Norse", 
                "PIE", 
                "Sanskrit"
            ], 
            "pos": null, 
            "prefix": "sub", 
            "term": "sub-"
        }
    ], 
    "suc-": [
        {
            "definition": "the usual form of sub- before -c-, an assimiliation from Latin. ", 
            "languages": [
                "Latin"
            ], 
            "pos": null, 
            "prefix": "suc", 
            "term": "suc-"
        }
    ], 
    "sucro-": [
        {
            "definition": "before vowels sucr-, scientific word-forming element meaning \"sugar,\" from Latinized form of French sucre \"sugar\" (see sugar (n.)).", 
            "languages": [
                "French", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "sucro", 
            "term": "sucro-"
        }
    ], 
    "suf-": [
        {
            "definition": "assimilated form of sub- before -f-.", 
            "languages": [], 
            "pos": null, 
            "prefix": "suf", 
            "term": "suf-"
        }
    ], 
    "sug-": [
        {
            "definition": "assimilated form of sub- before -g-.", 
            "languages": [], 
            "pos": null, 
            "prefix": "sug", 
            "term": "sug-"
        }
    ], 
    "sum-": [
        {
            "definition": "assimilated form of sub- before -m-.", 
            "languages": [], 
            "pos": null, 
            "prefix": "sum", 
            "term": "sum-"
        }
    ], 
    "sup-": [
        {
            "definition": "assimilated form of sub- before -p-.", 
            "languages": [], 
            "pos": null, 
            "prefix": "sup", 
            "term": "sup-"
        }
    ], 
    "super-": [
        {
            "definition": "word-forming element meaning \"above, over, beyond,\" from Latin super-, from adverb and preposition super \"above, over, on the top (of), beyond, besides, in addition to,\" from *(s)uper-, variant form of PIE *uper \"over\" (cognates: Sanskrit upari, Avestan upairi \"over, above, beyond,\" Greek hyper, Old English ofer \"over,\" Gothic ufaro \"over, across,\" Gaulish ver-, Old Irish for), comparative of root *upo \"under\" (see sub-). In English words from Old French, it appears as sur-. The primary sense seems to have shifted over time from usually meaning \"beyond\" to usually meaning \"very much,\" which can be contradictory. E.g. supersexual, which is attested from 1895 as \"transcending sexuality,\" from 1968 as \"very sexual.\"", 
            "languages": [
                "English", 
                "Gaulish", 
                "Gothic", 
                "Greek", 
                "Latin", 
                "Old French", 
                "Old Irish", 
                "PIE", 
                "Sanskrit"
            ], 
            "pos": null, 
            "prefix": "super", 
            "term": "super-"
        }
    ], 
    "supra-": [
        {
            "definition": "word-forming element meaning \"above, over, beyond, before,\" from Latin supra \"above, over, before, beyond, on the upper side,\" in supera (parte), literally \"on the upper (side),\" from old fem. ablative singular of superus (adj.) \"above,\" related to super \"above, over\" (see super-). In English interchangeable with, but somewhat more technical than, super-. Rare as a prefix in Latin, more common in Medieval Latin, in English chiefly scientific or technical.", 
            "languages": [
                "English", 
                "Latin", 
                "Medieval Latin"
            ], 
            "pos": null, 
            "prefix": "supra", 
            "term": "supra-"
        }
    ], 
    "sur-": [
        {
            "definition": "word-forming element meaning \"over, above, beyond, in addition,\" especially in words from Anglo-French and Old French, from Old French sour-, sor-, sur-, from Latin super (see super-).", 
            "languages": [
                "Anglo-French", 
                "Latin", 
                "Old French"
            ], 
            "pos": null, 
            "prefix": "sur", 
            "term": "sur-"
        }, 
        {
            "definition": "assimilated form of sub- before -r-.", 
            "languages": [], 
            "pos": null, 
            "prefix": "sur", 
            "term": "sur-"
        }
    ], 
    "sus-": [
        {
            "definition": "assimilated form of sub- before -s-.", 
            "languages": [], 
            "pos": null, 
            "prefix": "sus", 
            "term": "sus-"
        }
    ], 
    "sy-": [
        {
            "definition": "form of syn- before -s- or -z-.", 
            "languages": [], 
            "pos": null, 
            "prefix": "sy", 
            "term": "sy-"
        }
    ], 
    "syl-": [
        {
            "definition": "assimilated form of Greek syn- before -l-.", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "syl", 
            "term": "syl-"
        }
    ], 
    "sym-": [
        {
            "definition": "assimilated form of syn-, from Greek form of syn- in compounds with words beginning in -b-, -m-, -p-, -ph-, -ps-.", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "sym", 
            "term": "sym-"
        }
    ], 
    "syn-": [
        {
            "definition": "word-forming element meaning \"together with, jointly; alike; at the same time,\" also sometimes completive or intensive, from Greek syn (prep.) \"with, together with, along with, in the company of,\" from PIE *ksun- \"with\" (cognates: Russian so- \"with, together,\" from Old Russian su(n)-). Assimilated to -l-, reduced to sy- before -s- and -z-, and altered to sym- before -b-, -m- and -p-. Since 1970s also with a sense of \"synthetic.\"", 
            "languages": [
                "Greek", 
                "PIE", 
                "Russian"
            ], 
            "pos": null, 
            "prefix": "syn", 
            "term": "syn-"
        }
    ], 
    "tacho-": [
        {
            "definition": "word-forming element meaning \"speed,\" from Latinized form of Greek takho-, comb. form of takhos \"speed, swiftness, fleetness, velocity,\" related to takhys \"swift,\" of unknown origin.", 
            "languages": [
                "Greek", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "tacho", 
            "term": "tacho-"
        }
    ], 
    "tachy-": [
        {
            "definition": "word-forming element meaning \"rapid, swift, fast,\" from Latinized comb. form of Greek takhys \"swift, rapid, hasty,\" related to takhos \"speed, swiftness,\" of uncertain origin.", 
            "languages": [
                "Greek", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "tachy", 
            "term": "tachy-"
        }
    ], 
    "techno-": [
        {
            "definition": "word-forming element meaning \"art, craft, skill,\" later \"technical, technology,\" from Latinized form of Greek tekhno-, combining form of tekhne \"art, skill, craft in work; method, system, an art, a system or method of making or doing,\" from PIE *teks-na- \"craft\" (of weaving or fabricating), from suffixed form of root *teks- \"to weave, fabricate, make\" (cognates: Sanskrit taksan \"carpenter,\" Greek tekton \"carpenter,\" Latin texere \"to weave;\" see texture (n.)).", 
            "languages": [
                "Greek", 
                "Latin", 
                "PIE", 
                "Sanskrit"
            ], 
            "pos": null, 
            "prefix": "techno", 
            "term": "techno-"
        }
    ], 
    "tele-": [
        {
            "definition": "before vowels tel-, word-forming element meaning \"far, far off, operating over distance\" (also, since c.1940, \"television\"), from Greek tele-, combining form of tele \"far off, afar, at or to a distance,\" related to teleos (genitive telos) \"end, goal, completion, perfection,\" literally \"completion of a cycle,\" from PIE *kwel-es- (cognates: Sanskrit caramah \"the last,\" Breton pell \"far off,\" Welsh pellaf \"uttermost\"), perhaps from root *kwel- (1) (see cycle (n.)).", 
            "languages": [
                "Breton", 
                "Greek", 
                "PIE", 
                "Sanskrit"
            ], 
            "pos": null, 
            "prefix": "tele", 
            "term": "tele-"
        }
    ], 
    "ter-": [
        {
            "definition": "word-forming element meaning \"thrice, three times,\" from Latin ter \"thrice,\" from *tris-, from root of three. Compare Latin tertius \"third.\"", 
            "languages": [
                "Latin"
            ], 
            "pos": null, 
            "prefix": "ter", 
            "term": "ter-"
        }
    ], 
    "tera-": [
        {
            "definition": "prefix meaning \"trillion,\" used in forming large units of measure (such as terabyte), officially adopted 1947, from Greek teras \"marvel, monster\" (see terato-).", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "tera", 
            "term": "tera-"
        }
    ], 
    "terato-": [
        {
            "definition": "before vowels terat-, word-forming element meaning \"marvel, monster,\" from comb. form of Greek teras (genitive teratos) \"marvel, sign, wonder, monster,\" from PIE *kewr-es-, from root *kwer- \"to make, form\" (cognates: Sanskrit krta- \"make, do, perform,\" Lithuanian keras \"charm,\" Old Church Slavonic čaru \"charm\").", 
            "languages": [
                "Greek", 
                "Lithuanian", 
                "Old Church Slavonic", 
                "PIE", 
                "Sanskrit"
            ], 
            "pos": null, 
            "prefix": "terato", 
            "term": "terato-"
        }
    ], 
    "tetra-": [
        {
            "definition": "before vowels tet-, word-forming element meaning \"four,\" from Greek tetra-, combining form of tettares (Attic), tessares \"the numeral four\" (see four).", 
            "languages": [
                "Attic", 
                "Greek"
            ], 
            "pos": null, 
            "prefix": "tetra", 
            "term": "tetra-"
        }
    ], 
    "thalasso-": [
        {
            "definition": "before vowels thalass-, word-forming element meaning \"sea, the sea,\" from comb. form of Greek thalassa \"the sea\" (in Homer, when used of a particular sea, \"the Mediterranean,\" as opposed to okeanos), a word from a lost pre-Greek Mediterranean language. In Attic Greek thalatta, hence sometimes thalatto-.", 
            "languages": [
                "Attic", 
                "Greek"
            ], 
            "pos": null, 
            "prefix": "thalasso", 
            "term": "thalasso-"
        }
    ], 
    "thanato-": [
        {
            "definition": "before vowels thanat-, word-forming element meaning \"death,\" from Greek thanatos \"death,\" from PIE *dhwene- \"to disappear, die,\" perhaps from a root meaning \"dark, cloudy\" (compare Sanskrit dhvantah \"dark\"). Hence Bryant's \"Thanatopsis\", with Greek opsis \"a sight, view.\"", 
            "languages": [
                "Greek", 
                "PIE", 
                "Sanskrit"
            ], 
            "pos": null, 
            "prefix": "thanato", 
            "term": "thanato-"
        }
    ], 
    "theco-": [
        {
            "definition": "before vowels thec-, word-forming element used in botany and zoology with the sense \"case, capsule,\" from Latinized combining form of Greek theke \"case, receptacle,\" from root of tithenai \"to put, place\" (see theme).", 
            "languages": [
                "Greek", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "theco", 
            "term": "theco-"
        }
    ], 
    "theo-": [
        {
            "definition": "word-forming element meaning \"god, gods, God,\" from comb. form of Greek theos \"god,\" from PIE root *dhes-, root of words applied to various religious concepts, such as Latin feriae \"holidays,\" festus \"festive,\" fanum \"temple.\"", 
            "languages": [
                "Greek", 
                "Latin", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "theo", 
            "term": "theo-"
        }
    ], 
    "ther-": [
        {
            "definition": "often thero-, word-forming element meaning \"beast,\" from comb. form of Greek ther \"wild beast, beast of prey,\" from PIE *ghwer- \"wild beast\" (cognates: Latin ferus \"wild,\" ferox \"fierce;\" see fierce). Also therio-, from Greek therion.", 
            "languages": [
                "Greek", 
                "Latin", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "ther", 
            "term": "ther-"
        }
    ], 
    "thermo-": [
        {
            "definition": "before vowels therm-, word-forming element meaning \"hot, heat, temperature,\" used in scientific and technical words, from comb. form of Greek thermos \"hot, warm,\" therme \"heat\" (see thermal).", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "thermo", 
            "term": "thermo-"
        }
    ], 
    "thrombo-": [
        {
            "definition": "before vowels thromb-, word-forming element meaning \"blood clot,\" from comb. form Greek thrombos \"clot of blood\" (see thrombus).", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "thrombo", 
            "term": "thrombo-"
        }
    ], 
    "to-": [
        {
            "definition": "particle expressing separation, putting asunder, from West Germanic *ti- (cognates: Old Frisian ti-, Old High German zi-, German zer-), from Proto-Germanic *tiz-, cognate with Latin-derived dis-. According to OED, some 125 compound verbs with this element are recorded in Old English; their number declined rapidly in Middle English and disappeared by c. 1500 except as conscious archaisms (such as to-shiver \"break to pieces;\" all to-brast).", 
            "languages": [
                "English", 
                "German", 
                "Latin", 
                "Middle English", 
                "Old Frisian", 
                "Old High German", 
                "Proto-Germanic", 
                "West Germanic"
            ], 
            "pos": null, 
            "prefix": "to", 
            "term": "to-"
        }
    ], 
    "trans-": [
        {
            "definition": "word-forming element meaning \"across, beyond, through, on the other side of, to go beyond,\" from Latin trans-, from trans (prep.) \"across, over, beyond,\" perhaps originally present participle of a verb *trare-, meaning \"to cross,\" from PIE *tra-, variant of root *tere- (2) \"to cross over\" (see through). In chemical use indicating \"a compound in which two characteristic groups are situated on opposite sides of an axis of a molecule\" [Flood].", 
            "languages": [
                "Latin", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "trans", 
            "term": "trans-"
        }
    ], 
    "tri-": [
        {
            "definition": "word-forming element meaning \"three, having three, once every three,\" from Latin tres (neuter tria) or Greek treis, trias \"three\" (see three).", 
            "languages": [
                "Greek", 
                "Latin"
            ], 
            "pos": null, 
            "prefix": "tri", 
            "term": "tri-"
        }
    ], 
    "tropho-": [
        {
            "definition": "before vowels, troph-, word-forming element meaning \"nourishment, food,\" from comb. form of Greek trophe \"nourishment\" (see -trophy).", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "tropho", 
            "term": "tropho-"
        }
    ], 
    "turbo-": [
        {
            "definition": "word-forming element, abstracted c.1900 from turbine; influenced by Latin turbo \"spinning top.\" E.g. turbocharger (1934), aeronautic turboprop (1945, with second element short for propeller); turbojet (1945).", 
            "languages": [
                "Latin"
            ], 
            "pos": null, 
            "prefix": "turbo", 
            "term": "turbo-"
        }
    ], 
    "twi-": [
        {
            "definition": "word-forming element meaning \"two, twice, double, in two ways,\" from Old English twi- \"two, in two ways, twice, double,\" from Proto-Germanic *twi- (cognates: Old Frisian twi-, Old Norse tvi-, Dutch twee-, Old High German zwi-, German zwei-), from PIE *dwis (cognates: Sanskrit dvi-, Greek di-, Old Latin dvi-, Latin bi-, Lithuanian dvi-), from *dwo \"two\" (see two). Cognate with bi-. Older instances of it include Middle English twinter \"two years old\" (c. 1400, of cattle, sheep, etc.), reduced from Old English twi-wintre, and Old English twispræc \"double or deceitful speech.\"", 
            "languages": [
                "Dutch", 
                "English", 
                "German", 
                "Greek", 
                "Latin", 
                "Lithuanian", 
                "Middle English", 
                "Old Frisian", 
                "Old High German", 
                "Old Norse", 
                "PIE", 
                "Proto-Germanic", 
                "Sanskrit"
            ], 
            "pos": null, 
            "prefix": "twi", 
            "term": "twi-"
        }
    ], 
    "ultra-": [
        {
            "definition": "word-forming element meaning \"beyond\" (ultraviolet) or \"extremely\" (ultramodern), from Latin ultra- from ultra (adv. and prep.) \"beyond, on the other side, on the farther side, past, over, across,\" from PIE *ol-tero-, suffixed form of root *al- (1) \"beyond\" (see alias (adv.)). In common use from early 19c., it appears to have arisen from French political designations. As its own word, a noun meaning \"extremist\" of various stripes, it is first recorded 1817, from French ultra, shortening of ultra-royaliste \"extreme royalist.\"", 
            "languages": [
                "French", 
                "Latin", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "ultra", 
            "term": "ultra-"
        }
    ], 
    "un-": [
        {
            "definition": "prefix of negation, Old English un-, from Proto-Germanic *un- (cognates: Old Saxon, Old Frisian, Old High German, German un-, Gothic un-, Dutch on-), from PIE *n- (source of Sanskrit a-, an- \"not,\" Greek a-, an-, Old Irish an-, Latin in-), comb. form of PIE root *ne \"not\" (cognates: Avestan na, Old Church Slavonic and Lithuanian ne \"not,\" Latin ne \"that not,\" Greek ne- \"not,\" Old Irish ni, Cornish ny \"not\"). Often euphemistic (such as untruth for \"lie\"). \r\n\r\nThe most prolific of English prefixes, freely and widely used in Old English, where it forms more than 1,000 compounds. It underwent a mass extinction in early Middle English, but emerged with renewed vigor 16c. to form compounds with native and imported words. It disputes with Latin-derived cognate in- (1) the right to form the negation of certain words (indigestable/undigestable, etc.), and though both might be deployed in cooperation to indicate shades of meaning (unfamous/infamous), typically they are not.\r\n\r\nIt also makes words from phrases (such as uncalled-for, c. 1600; undreamed-of, 1630s; uncome-at-able, 1690s; unputdownable, 1947, of a book; un-in-one-breath-utterable, Ben Jonson; etc., but the habit is not restricted to un-; such as put-up-able-with, 1812). As a prefix in telegramese to replace not and save the cost of a word, it is attested by 1936.", 
            "languages": [
                "Cornish", 
                "Dutch", 
                "English", 
                "German", 
                "Gothic", 
                "Greek", 
                "Latin", 
                "Lithuanian", 
                "Middle English", 
                "Old Church Slavonic", 
                "Old English,", 
                "Old Frisian", 
                "Old High German", 
                "Old Irish", 
                "Old Saxon", 
                "PIE", 
                "Proto-Germanic", 
                "Sanskrit"
            ], 
            "pos": null, 
            "prefix": "un", 
            "term": "un-"
        }, 
        {
            "definition": "prefix of reversal, deprivation, or removal (as in unhand, undo, unbutton), Old English on-, un-, from Proto-Germanic *andi- (cognates: Old Saxon ant-, Old Norse and-, Dutch ont-, Old High German ant-, German ant-, Gothic and- \"against\"), from PIE *anti \"facing opposite, near, in front of, before, against\" (see ante).\r\n\r\nMore or less confused with un- (1) through similarity in the notions of \"negation\" and \"reversal;\" an adjective such as unlocked might represent \"not locked\" (un- (1)) or the past tense of unlock (un- (2)).", 
            "languages": [
                "Dutch", 
                "English", 
                "German", 
                "Gothic", 
                "Old High German", 
                "Old Norse", 
                "Old Saxon", 
                "PIE", 
                "Proto-Germanic"
            ], 
            "pos": null, 
            "prefix": "un", 
            "term": "un-"
        }
    ], 
    "uni-": [
        {
            "definition": "word-forming element meaning \"having one only,\" from Latin uni-, comb. form of unus (see one).", 
            "languages": [
                "Latin"
            ], 
            "pos": null, 
            "prefix": "uni", 
            "term": "uni-"
        }
    ], 
    "up-": [
        {
            "definition": "prefix with various senses, from Old English up (adv.), corresponding to similar prefixes in other Germanic languages.", 
            "languages": [
                "English", 
                "Germanic"
            ], 
            "pos": null, 
            "prefix": "up", 
            "term": "up-"
        }
    ], 
    "ur-": [
        {
            "definition": "prefix meaning \"original, earliest, primitive,\" from German ur- \"out of, original,\" from Proto-Germanic *uz- \"out,\" from PIE *ud- \"up, out\" (see out (adv.)) At first only in words borrowed from German (such as ursprache \"hypothetical primitive language\"); since mid-20c. a living prefix in English. Compare also Urschleim under protoplasm and Urquell under Pilsner.", 
            "languages": [
                "English", 
                "German", 
                "PIE", 
                "Proto-Germanic"
            ], 
            "pos": null, 
            "prefix": "ur", 
            "term": "ur-"
        }
    ], 
    "uro-": [
        {
            "definition": "word-forming element meaning \"urine,\" from comb. form of Greek ouron \"urine\" (see urine).", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "uro", 
            "term": "uro-"
        }
    ], 
    "utero-": [
        {
            "definition": "before vowels uter-, word-forming element, from comb. form of Latin uterus (see uterus).", 
            "languages": [
                "Latin"
            ], 
            "pos": null, 
            "prefix": "utero", 
            "term": "utero-"
        }
    ], 
    "ver-": [
        {
            "definition": "German prefix \"denoting destruction, reversal, or completion\" [Watkins], from Proto-Germanic *fer-, *far- (see per).", 
            "languages": [
                "German", 
                "Proto-Germanic"
            ], 
            "pos": null, 
            "prefix": "ver", 
            "term": "ver-"
        }
    ], 
    "vice-": [
        {
            "definition": "word-forming element meaning \"deputy, assistant, substitute,\" also \"instead of, in place of,\" 15c., from Latin vice \"in place of,\" ablative of vicis \"a change, a turn, interchange alternation\" (see vicarious). In Middle English sometimes borrowed in Old French form vis-, vi-.", 
            "languages": [
                "Latin", 
                "Middle English", 
                "Old French"
            ], 
            "pos": null, 
            "prefix": "vice", 
            "term": "vice-"
        }
    ], 
    "video-": [
        {
            "definition": "word-forming element; see video (adj.).", 
            "languages": [], 
            "pos": null, 
            "prefix": "video", 
            "term": "video-"
        }
    ], 
    "vitro-": [
        {
            "definition": "word-forming element meaning \"glass,\" from comb. form of Latin vitrum \"glass\" (see vitreous).", 
            "languages": [
                "Latin"
            ], 
            "pos": null, 
            "prefix": "vitro", 
            "term": "vitro-"
        }
    ], 
    "wh-": [
        {
            "definition": "respelling of Old English hw- attested from 11c., but not the common form until after c. 1400. It represents PIE *kw-; in German reduced to simple w-, in Scandinavian as hv-, kv-, or v-.\r\n\r\nAlso added to some borrowed words (whisk, whiskey) and some native words formerly spelled with simple w- or h- (whole, whore). In the 15c. flowering of its use it also threatened to change the spelling of hot, home and many more. In northern English 16c.-18c., sometimes altered to quh- (see Q). Proper pronunciation has been much in dispute in educated speech. ", 
            "languages": [
                "English", 
                "German", 
                "PIE", 
                "Scandinavian"
            ], 
            "pos": null, 
            "prefix": "wh", 
            "term": "wh-"
        }
    ], 
    "wl-": [
        {
            "definition": "an initial sound cluster in words in Old English and early Middle English; among the Old English words were wlanc \"stately, splendid;\" wlætung \"nausea;\" wlenc \"pride, arrogance\" (Middle English wlonk); wlite \"brightness, beauty, splendor;\" wlitig\" radiant, physically beautiful (Middle English wliti).", 
            "languages": [
                "English", 
                "Middle English"
            ], 
            "pos": null, 
            "prefix": "wl", 
            "term": "wl-"
        }
    ], 
    "wr-": [
        {
            "definition": "common Germanic consonantal combination, especially to start words implying twisting or distortion. Retained in Dutch and Flemish; reduced to -r- in Old High German and Old Norse; represented by vr- in Danish and Swedish; still spelled -wr- in English, but the -w- ceased to be pronounced c.1450-1700 except in dialects.", 
            "languages": [
                "Danish", 
                "Dutch", 
                "English", 
                "Flemish", 
                "Germanic", 
                "Old High German", 
                "Old Norse", 
                "Swedish"
            ], 
            "pos": null, 
            "prefix": "wr", 
            "term": "wr-"
        }
    ], 
    "yester-": [
        {
            "definition": "Old English geostran \"yesterday,\" from Proto-Germanic *gester- (cognates: Old High German gestaron, German gestern \"yesterday,\" Old Norse gær \"tomorrow, yesterday,\" Gothic gistradagis \"tomorrow\"), originally \"the other day\" (reckoned from \"today,\" either backward or forward), from PIE root *dhgh(y)es- \"yesterday\" (cognates: Sanskrit hyah, Avestan zyo, Persian di, Greek khthes, Latin heri, Old Irish indhe, Welsh doe \"yesterday;\" Latin hesternus \"of yesterday\").", 
            "languages": [
                "English", 
                "German", 
                "Gothic", 
                "Greek", 
                "Latin", 
                "Old High German", 
                "Old Irish", 
                "Old Norse", 
                "PIE", 
                "Persian", 
                "Proto-Germanic", 
                "Sanskrit"
            ], 
            "pos": null, 
            "prefix": "yester", 
            "term": "yester-"
        }
    ], 
    "zeno-": [
        {
            "definition": "late 20c. word-forming element used in reference to the planet Jupiter, from Greek zeno-, comb. form from Zeus (see Zeus; also compare Zenobia).", 
            "languages": [
                "Greek"
            ], 
            "pos": null, 
            "prefix": "zeno", 
            "term": "zeno-"
        }
    ], 
    "zoo-": [
        {
            "definition": "word-forming element meaning \"animal, living being,\" from comb. form of Greek zoion \"an animal,\" literally \"a living being,\" from PIE root *gwei- \"to live, life\" (source also of Greek bios \"life,\" Old English cwicu \"living;\" see bio-). ", 
            "languages": [
                "English", 
                "Greek", 
                "PIE"
            ], 
            "pos": null, 
            "prefix": "zoo", 
            "term": "zoo-"
        }
    ]
}